remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
/**
 * \file
 *
 * \brief Component description for ARM_SYSCTRL
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_ARM_SYSCTRL_COMPONENT_
#define _SAMB11_ARM_SYSCTRL_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ARM_SYSCTRL */
/* ========================================================================== */
/** \addtogroup SAMB11_ARM_SYSCTRL ARM System Control 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define ARM_SYSCTRL_ASC1234
#define REV_ARM_SYSCTRL                  0x100

/* -------- ARM_SYSCTRL_ACTLR : (ARM_SYSCTRL Offset: 0x08) (R/ 32) Auxiliary Control Register (not implemented) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ACTLR:32;                  /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_ACTLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_ACTLR_OFFSET            0x08                                          /**<  (ARM_SYSCTRL_ACTLR) Auxiliary Control Register (not implemented)  Offset */
#define ARM_SYSCTRL_ACTLR_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_ACTLR) Auxiliary Control Register (not implemented)  Reset Value */

#define ARM_SYSCTRL_ACTLR_ACTLR_Pos         0                                              /**< (ARM_SYSCTRL_ACTLR)  Position */
#define ARM_SYSCTRL_ACTLR_ACTLR_Msk         (0xFFFFFFFFu << ARM_SYSCTRL_ACTLR_ACTLR_Pos)   /**< (ARM_SYSCTRL_ACTLR)  Mask */
#define ARM_SYSCTRL_ACTLR_ACTLR(value)      (ARM_SYSCTRL_ACTLR_ACTLR_Msk & ((value) << ARM_SYSCTRL_ACTLR_ACTLR_Pos))
#define ARM_SYSCTRL_ACTLR_MASK              0xFFFFFFFFu                                    /**< \deprecated (ARM_SYSCTRL_ACTLR) Register MASK  (Use ARM_SYSCTRL_ACTLR_Msk instead)  */
#define ARM_SYSCTRL_ACTLR_Msk               0xFFFFFFFFu                                    /**< (ARM_SYSCTRL_ACTLR) Register Mask  */

/* -------- ARM_SYSCTRL_SYST_CSR : (ARM_SYSCTRL Offset: 0x10) (R/W 32) SysTick Control and Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ENABLE:1;                  /**< bit:      0  Indicates the enabled status of the SysTick counter */
    uint32_t TICKINT:1;                 /**< bit:      1  Indicates whether counting to 0 causes the status of the SysTick exception to change to pending */
    uint32_t CLKSOURCE:1;               /**< bit:      2  SysTick uses the processor clock (writes are ignored) */
    uint32_t :13;                       /**< bit:  3..15  Reserved */
    uint32_t COUNTFLAG:1;               /**< bit:     16  If 1 then the timer has counted to 0     */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SYST_CSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SYST_CSR_OFFSET         0x10                                          /**<  (ARM_SYSCTRL_SYST_CSR) SysTick Control and Status Register  Offset */
#define ARM_SYSCTRL_SYST_CSR_RESETVALUE     0x04u                                         /**<  (ARM_SYSCTRL_SYST_CSR) SysTick Control and Status Register  Reset Value */

#define ARM_SYSCTRL_SYST_CSR_ENABLE_Pos     0                                              /**< (ARM_SYSCTRL_SYST_CSR) Indicates the enabled status of the SysTick counter Position */
#define ARM_SYSCTRL_SYST_CSR_ENABLE_Msk     (0x1u << ARM_SYSCTRL_SYST_CSR_ENABLE_Pos)      /**< (ARM_SYSCTRL_SYST_CSR) Indicates the enabled status of the SysTick counter Mask */
#define ARM_SYSCTRL_SYST_CSR_ENABLE         ARM_SYSCTRL_SYST_CSR_ENABLE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SYST_CSR_ENABLE_Msk instead */
#define   ARM_SYSCTRL_SYST_CSR_ENABLE_0_Val 0x0u                                           /**< (ARM_SYSCTRL_SYST_CSR) Counter Disabled  */
#define   ARM_SYSCTRL_SYST_CSR_ENABLE_1_Val 0x1u                                           /**< (ARM_SYSCTRL_SYST_CSR) Counter Operating  */
#define ARM_SYSCTRL_SYST_CSR_ENABLE_0       (ARM_SYSCTRL_SYST_CSR_ENABLE_0_Val << ARM_SYSCTRL_SYST_CSR_ENABLE_Pos)  /**< (ARM_SYSCTRL_SYST_CSR) Counter Disabled Position  */
#define ARM_SYSCTRL_SYST_CSR_ENABLE_1       (ARM_SYSCTRL_SYST_CSR_ENABLE_1_Val << ARM_SYSCTRL_SYST_CSR_ENABLE_Pos)  /**< (ARM_SYSCTRL_SYST_CSR) Counter Operating Position  */
#define ARM_SYSCTRL_SYST_CSR_TICKINT_Pos    1                                              /**< (ARM_SYSCTRL_SYST_CSR) Indicates whether counting to 0 causes the status of the SysTick exception to change to pending Position */
#define ARM_SYSCTRL_SYST_CSR_TICKINT_Msk    (0x1u << ARM_SYSCTRL_SYST_CSR_TICKINT_Pos)     /**< (ARM_SYSCTRL_SYST_CSR) Indicates whether counting to 0 causes the status of the SysTick exception to change to pending Mask */
#define ARM_SYSCTRL_SYST_CSR_TICKINT        ARM_SYSCTRL_SYST_CSR_TICKINT_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SYST_CSR_TICKINT_Msk instead */
#define   ARM_SYSCTRL_SYST_CSR_TICKINT_0_Val 0x0u                                           /**< (ARM_SYSCTRL_SYST_CSR) Count to 0 does not affect the SysTick exception status  */
#define   ARM_SYSCTRL_SYST_CSR_TICKINT_1_Val 0x1u                                           /**< (ARM_SYSCTRL_SYST_CSR) Count to 0 changes the SysTick excpetion status to pending  */
#define ARM_SYSCTRL_SYST_CSR_TICKINT_0      (ARM_SYSCTRL_SYST_CSR_TICKINT_0_Val << ARM_SYSCTRL_SYST_CSR_TICKINT_Pos)  /**< (ARM_SYSCTRL_SYST_CSR) Count to 0 does not affect the SysTick exception status Position  */
#define ARM_SYSCTRL_SYST_CSR_TICKINT_1      (ARM_SYSCTRL_SYST_CSR_TICKINT_1_Val << ARM_SYSCTRL_SYST_CSR_TICKINT_Pos)  /**< (ARM_SYSCTRL_SYST_CSR) Count to 0 changes the SysTick excpetion status to pending Position  */
#define ARM_SYSCTRL_SYST_CSR_CLKSOURCE_Pos  2                                              /**< (ARM_SYSCTRL_SYST_CSR) SysTick uses the processor clock (writes are ignored) Position */
#define ARM_SYSCTRL_SYST_CSR_CLKSOURCE_Msk  (0x1u << ARM_SYSCTRL_SYST_CSR_CLKSOURCE_Pos)   /**< (ARM_SYSCTRL_SYST_CSR) SysTick uses the processor clock (writes are ignored) Mask */
#define ARM_SYSCTRL_SYST_CSR_CLKSOURCE      ARM_SYSCTRL_SYST_CSR_CLKSOURCE_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SYST_CSR_CLKSOURCE_Msk instead */
#define ARM_SYSCTRL_SYST_CSR_COUNTFLAG_Pos  16                                             /**< (ARM_SYSCTRL_SYST_CSR) If 1 then the timer has counted to 0 Position */
#define ARM_SYSCTRL_SYST_CSR_COUNTFLAG_Msk  (0x1u << ARM_SYSCTRL_SYST_CSR_COUNTFLAG_Pos)   /**< (ARM_SYSCTRL_SYST_CSR) If 1 then the timer has counted to 0 Mask */
#define ARM_SYSCTRL_SYST_CSR_COUNTFLAG      ARM_SYSCTRL_SYST_CSR_COUNTFLAG_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SYST_CSR_COUNTFLAG_Msk instead */
#define ARM_SYSCTRL_SYST_CSR_MASK           0x10007u                                       /**< \deprecated (ARM_SYSCTRL_SYST_CSR) Register MASK  (Use ARM_SYSCTRL_SYST_CSR_Msk instead)  */
#define ARM_SYSCTRL_SYST_CSR_Msk            0x10007u                                       /**< (ARM_SYSCTRL_SYST_CSR) Register Mask  */

/* -------- ARM_SYSCTRL_SYST_RVR : (ARM_SYSCTRL Offset: 0x14) (R/W 32) SysTick Reload Value Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SYST_RVR:24;               /**< bit:  0..23                                           */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SYST_RVR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SYST_RVR_OFFSET         0x14                                          /**<  (ARM_SYSCTRL_SYST_RVR) SysTick Reload Value Register  Offset */
#define ARM_SYSCTRL_SYST_RVR_RESETVALUE     0x00u                                         /**<  (ARM_SYSCTRL_SYST_RVR) SysTick Reload Value Register  Reset Value */

