remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#define ARM_SYSCTRL_SYST_RVR_SYST_RVR_Pos   0                                              /**< (ARM_SYSCTRL_SYST_RVR)  Position */
#define ARM_SYSCTRL_SYST_RVR_SYST_RVR_Msk   (0xFFFFFFu << ARM_SYSCTRL_SYST_RVR_SYST_RVR_Pos)  /**< (ARM_SYSCTRL_SYST_RVR)  Mask */
#define ARM_SYSCTRL_SYST_RVR_SYST_RVR(value) (ARM_SYSCTRL_SYST_RVR_SYST_RVR_Msk & ((value) << ARM_SYSCTRL_SYST_RVR_SYST_RVR_Pos))
#define ARM_SYSCTRL_SYST_RVR_MASK           0xFFFFFFu                                      /**< \deprecated (ARM_SYSCTRL_SYST_RVR) Register MASK  (Use ARM_SYSCTRL_SYST_RVR_Msk instead)  */
#define ARM_SYSCTRL_SYST_RVR_Msk            0xFFFFFFu                                      /**< (ARM_SYSCTRL_SYST_RVR) Register Mask  */

/* -------- ARM_SYSCTRL_SYST_CVR : (ARM_SYSCTRL Offset: 0x18) (R/W 32) SysTick Current Value Register (Any Write Clears to 0) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SYST_CVR:24;               /**< bit:  0..23                                           */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SYST_CVR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SYST_CVR_OFFSET         0x18                                          /**<  (ARM_SYSCTRL_SYST_CVR) SysTick Current Value Register (Any Write Clears to 0)  Offset */
#define ARM_SYSCTRL_SYST_CVR_RESETVALUE     0x00u                                         /**<  (ARM_SYSCTRL_SYST_CVR) SysTick Current Value Register (Any Write Clears to 0)  Reset Value */

#define ARM_SYSCTRL_SYST_CVR_SYST_CVR_Pos   0                                              /**< (ARM_SYSCTRL_SYST_CVR)  Position */
#define ARM_SYSCTRL_SYST_CVR_SYST_CVR_Msk   (0xFFFFFFu << ARM_SYSCTRL_SYST_CVR_SYST_CVR_Pos)  /**< (ARM_SYSCTRL_SYST_CVR)  Mask */
#define ARM_SYSCTRL_SYST_CVR_SYST_CVR(value) (ARM_SYSCTRL_SYST_CVR_SYST_CVR_Msk & ((value) << ARM_SYSCTRL_SYST_CVR_SYST_CVR_Pos))
#define ARM_SYSCTRL_SYST_CVR_MASK           0xFFFFFFu                                      /**< \deprecated (ARM_SYSCTRL_SYST_CVR) Register MASK  (Use ARM_SYSCTRL_SYST_CVR_Msk instead)  */
#define ARM_SYSCTRL_SYST_CVR_Msk            0xFFFFFFu                                      /**< (ARM_SYSCTRL_SYST_CVR) Register Mask  */

/* -------- ARM_SYSCTRL_SYST_CALIB : (ARM_SYSCTRL Offset: 0x1c) (R/ 32) SysTick Calibration Value Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TENMS:24;                  /**< bit:  0..23  Holds a reload value to be used for 10ms timing. If 0 then calibration value is not known. */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t SKEW:1;                    /**< bit:     30  If 1 then 10ms calibration value is inexact */
    uint32_t NOREF:1;                   /**< bit:     31  If 1 then reference clock is not implemented */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SYST_CALIB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SYST_CALIB_OFFSET       0x1C                                          /**<  (ARM_SYSCTRL_SYST_CALIB) SysTick Calibration Value Register  Offset */
#define ARM_SYSCTRL_SYST_CALIB_RESETVALUE   0x00u                                         /**<  (ARM_SYSCTRL_SYST_CALIB) SysTick Calibration Value Register  Reset Value */

#define ARM_SYSCTRL_SYST_CALIB_TENMS_Pos    0                                              /**< (ARM_SYSCTRL_SYST_CALIB) Holds a reload value to be used for 10ms timing. If 0 then calibration value is not known. Position */
#define ARM_SYSCTRL_SYST_CALIB_TENMS_Msk    (0xFFFFFFu << ARM_SYSCTRL_SYST_CALIB_TENMS_Pos)  /**< (ARM_SYSCTRL_SYST_CALIB) Holds a reload value to be used for 10ms timing. If 0 then calibration value is not known. Mask */
#define ARM_SYSCTRL_SYST_CALIB_TENMS(value) (ARM_SYSCTRL_SYST_CALIB_TENMS_Msk & ((value) << ARM_SYSCTRL_SYST_CALIB_TENMS_Pos))
#define ARM_SYSCTRL_SYST_CALIB_SKEW_Pos     30                                             /**< (ARM_SYSCTRL_SYST_CALIB) If 1 then 10ms calibration value is inexact Position */
#define ARM_SYSCTRL_SYST_CALIB_SKEW_Msk     (0x1u << ARM_SYSCTRL_SYST_CALIB_SKEW_Pos)      /**< (ARM_SYSCTRL_SYST_CALIB) If 1 then 10ms calibration value is inexact Mask */
#define ARM_SYSCTRL_SYST_CALIB_SKEW         ARM_SYSCTRL_SYST_CALIB_SKEW_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SYST_CALIB_SKEW_Msk instead */
#define ARM_SYSCTRL_SYST_CALIB_NOREF_Pos    31                                             /**< (ARM_SYSCTRL_SYST_CALIB) If 1 then reference clock is not implemented Position */
#define ARM_SYSCTRL_SYST_CALIB_NOREF_Msk    (0x1u << ARM_SYSCTRL_SYST_CALIB_NOREF_Pos)     /**< (ARM_SYSCTRL_SYST_CALIB) If 1 then reference clock is not implemented Mask */
#define ARM_SYSCTRL_SYST_CALIB_NOREF        ARM_SYSCTRL_SYST_CALIB_NOREF_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SYST_CALIB_NOREF_Msk instead */
#define ARM_SYSCTRL_SYST_CALIB_MASK         0xC0FFFFFFu                                    /**< \deprecated (ARM_SYSCTRL_SYST_CALIB) Register MASK  (Use ARM_SYSCTRL_SYST_CALIB_Msk instead)  */
#define ARM_SYSCTRL_SYST_CALIB_Msk          0xC0FFFFFFu                                    /**< (ARM_SYSCTRL_SYST_CALIB) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_ISER : (ARM_SYSCTRL Offset: 0x100) (R/W 32) Interrupt Set-Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SETENA:32;                 /**< bit:  0..31  Write 1 to enable the associated interrupt */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_ISER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

