remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#define ARM_SYSCTRL_NVIC_ISER_OFFSET        0x100                                         /**<  (ARM_SYSCTRL_NVIC_ISER) Interrupt Set-Enable Register  Offset */
#define ARM_SYSCTRL_NVIC_ISER_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_ISER) Interrupt Set-Enable Register  Reset Value */

#define ARM_SYSCTRL_NVIC_ISER_SETENA_Pos    0                                              /**< (ARM_SYSCTRL_NVIC_ISER) Write 1 to enable the associated interrupt Position */
#define ARM_SYSCTRL_NVIC_ISER_SETENA_Msk    (0xFFFFFFFFu << ARM_SYSCTRL_NVIC_ISER_SETENA_Pos)  /**< (ARM_SYSCTRL_NVIC_ISER) Write 1 to enable the associated interrupt Mask */
#define ARM_SYSCTRL_NVIC_ISER_SETENA(value) (ARM_SYSCTRL_NVIC_ISER_SETENA_Msk & ((value) << ARM_SYSCTRL_NVIC_ISER_SETENA_Pos))
#define ARM_SYSCTRL_NVIC_ISER_MASK          0xFFFFFFFFu                                    /**< \deprecated (ARM_SYSCTRL_NVIC_ISER) Register MASK  (Use ARM_SYSCTRL_NVIC_ISER_Msk instead)  */
#define ARM_SYSCTRL_NVIC_ISER_Msk           0xFFFFFFFFu                                    /**< (ARM_SYSCTRL_NVIC_ISER) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_ICER : (ARM_SYSCTRL Offset: 0x180) (R/W 32) Interrupt Clear Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CLRENA:32;                 /**< bit:  0..31  Write 1 to disable the associated interrupt */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_ICER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_ICER_OFFSET        0x180                                         /**<  (ARM_SYSCTRL_NVIC_ICER) Interrupt Clear Enable Register  Offset */
#define ARM_SYSCTRL_NVIC_ICER_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_ICER) Interrupt Clear Enable Register  Reset Value */

#define ARM_SYSCTRL_NVIC_ICER_CLRENA_Pos    0                                              /**< (ARM_SYSCTRL_NVIC_ICER) Write 1 to disable the associated interrupt Position */
#define ARM_SYSCTRL_NVIC_ICER_CLRENA_Msk    (0xFFFFFFFFu << ARM_SYSCTRL_NVIC_ICER_CLRENA_Pos)  /**< (ARM_SYSCTRL_NVIC_ICER) Write 1 to disable the associated interrupt Mask */
#define ARM_SYSCTRL_NVIC_ICER_CLRENA(value) (ARM_SYSCTRL_NVIC_ICER_CLRENA_Msk & ((value) << ARM_SYSCTRL_NVIC_ICER_CLRENA_Pos))
#define ARM_SYSCTRL_NVIC_ICER_MASK          0xFFFFFFFFu                                    /**< \deprecated (ARM_SYSCTRL_NVIC_ICER) Register MASK  (Use ARM_SYSCTRL_NVIC_ICER_Msk instead)  */
#define ARM_SYSCTRL_NVIC_ICER_Msk           0xFFFFFFFFu                                    /**< (ARM_SYSCTRL_NVIC_ICER) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_ISPR : (ARM_SYSCTRL Offset: 0x200) (R/W 32) Interrupt Set-Pending Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SETPEND:32;                /**< bit:  0..31  Change the state of the associated interrupt to pending */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_ISPR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_ISPR_OFFSET        0x200                                         /**<  (ARM_SYSCTRL_NVIC_ISPR) Interrupt Set-Pending Register  Offset */
#define ARM_SYSCTRL_NVIC_ISPR_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_ISPR) Interrupt Set-Pending Register  Reset Value */

#define ARM_SYSCTRL_NVIC_ISPR_SETPEND_Pos   0                                              /**< (ARM_SYSCTRL_NVIC_ISPR) Change the state of the associated interrupt to pending Position */
#define ARM_SYSCTRL_NVIC_ISPR_SETPEND_Msk   (0xFFFFFFFFu << ARM_SYSCTRL_NVIC_ISPR_SETPEND_Pos)  /**< (ARM_SYSCTRL_NVIC_ISPR) Change the state of the associated interrupt to pending Mask */
#define ARM_SYSCTRL_NVIC_ISPR_SETPEND(value) (ARM_SYSCTRL_NVIC_ISPR_SETPEND_Msk & ((value) << ARM_SYSCTRL_NVIC_ISPR_SETPEND_Pos))
#define ARM_SYSCTRL_NVIC_ISPR_MASK          0xFFFFFFFFu                                    /**< \deprecated (ARM_SYSCTRL_NVIC_ISPR) Register MASK  (Use ARM_SYSCTRL_NVIC_ISPR_Msk instead)  */
#define ARM_SYSCTRL_NVIC_ISPR_Msk           0xFFFFFFFFu                                    /**< (ARM_SYSCTRL_NVIC_ISPR) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_ICPR : (ARM_SYSCTRL Offset: 0x280) (R/W 32) Interrupt Clear-Pending Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CLRPEND:32;                /**< bit:  0..31  Change the state of the associated interrupt to not pending */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_ICPR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_ICPR_OFFSET        0x280                                         /**<  (ARM_SYSCTRL_NVIC_ICPR) Interrupt Clear-Pending Register  Offset */
#define ARM_SYSCTRL_NVIC_ICPR_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_ICPR) Interrupt Clear-Pending Register  Reset Value */

#define ARM_SYSCTRL_NVIC_ICPR_CLRPEND_Pos   0                                              /**< (ARM_SYSCTRL_NVIC_ICPR) Change the state of the associated interrupt to not pending Position */
#define ARM_SYSCTRL_NVIC_ICPR_CLRPEND_Msk   (0xFFFFFFFFu << ARM_SYSCTRL_NVIC_ICPR_CLRPEND_Pos)  /**< (ARM_SYSCTRL_NVIC_ICPR) Change the state of the associated interrupt to not pending Mask */
#define ARM_SYSCTRL_NVIC_ICPR_CLRPEND(value) (ARM_SYSCTRL_NVIC_ICPR_CLRPEND_Msk & ((value) << ARM_SYSCTRL_NVIC_ICPR_CLRPEND_Pos))
#define ARM_SYSCTRL_NVIC_ICPR_MASK          0xFFFFFFFFu                                    /**< \deprecated (ARM_SYSCTRL_NVIC_ICPR) Register MASK  (Use ARM_SYSCTRL_NVIC_ICPR_Msk instead)  */
#define ARM_SYSCTRL_NVIC_ICPR_Msk           0xFFFFFFFFu                                    /**< (ARM_SYSCTRL_NVIC_ICPR) Register Mask  */

