remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
/* -------- ARM_SYSCTRL_NVIC_IPR0 : (ARM_SYSCTRL Offset: 0x400) (R/W 32) Interrupt Priority Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t PRI_N0:2;                  /**< bit:   6..7  Priority of Interrupt 0                  */
    uint32_t :6;                        /**< bit:  8..13  Reserved */
    uint32_t PRI_N1:2;                  /**< bit: 14..15  Priority of Interrupt 1                  */
    uint32_t :6;                        /**< bit: 16..21  Reserved */
    uint32_t PRI_N2:2;                  /**< bit: 22..23  Priority of Interrupt 2                  */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_N3:2;                  /**< bit: 30..31  Priority of Interrupt 3                  */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_IPR0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_IPR0_OFFSET        0x400                                         /**<  (ARM_SYSCTRL_NVIC_IPR0) Interrupt Priority Register 0  Offset */
#define ARM_SYSCTRL_NVIC_IPR0_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_IPR0) Interrupt Priority Register 0  Reset Value */

#define ARM_SYSCTRL_NVIC_IPR0_PRI_N0_Pos    6                                              /**< (ARM_SYSCTRL_NVIC_IPR0) Priority of Interrupt 0 Position */
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N0_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR0_PRI_N0_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR0) Priority of Interrupt 0 Mask */
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N0(value) (ARM_SYSCTRL_NVIC_IPR0_PRI_N0_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR0_PRI_N0_Pos))
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N1_Pos    14                                             /**< (ARM_SYSCTRL_NVIC_IPR0) Priority of Interrupt 1 Position */
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N1_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR0_PRI_N1_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR0) Priority of Interrupt 1 Mask */
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N1(value) (ARM_SYSCTRL_NVIC_IPR0_PRI_N1_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR0_PRI_N1_Pos))
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N2_Pos    22                                             /**< (ARM_SYSCTRL_NVIC_IPR0) Priority of Interrupt 2 Position */
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N2_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR0_PRI_N2_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR0) Priority of Interrupt 2 Mask */
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N2(value) (ARM_SYSCTRL_NVIC_IPR0_PRI_N2_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR0_PRI_N2_Pos))
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N3_Pos    30                                             /**< (ARM_SYSCTRL_NVIC_IPR0) Priority of Interrupt 3 Position */
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N3_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR0_PRI_N3_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR0) Priority of Interrupt 3 Mask */
#define ARM_SYSCTRL_NVIC_IPR0_PRI_N3(value) (ARM_SYSCTRL_NVIC_IPR0_PRI_N3_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR0_PRI_N3_Pos))
#define ARM_SYSCTRL_NVIC_IPR0_MASK          0xC0C0C0C0u                                    /**< \deprecated (ARM_SYSCTRL_NVIC_IPR0) Register MASK  (Use ARM_SYSCTRL_NVIC_IPR0_Msk instead)  */
#define ARM_SYSCTRL_NVIC_IPR0_Msk           0xC0C0C0C0u                                    /**< (ARM_SYSCTRL_NVIC_IPR0) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_IPR1 : (ARM_SYSCTRL Offset: 0x404) (R/W 32) Interrupt Priority Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t PRI_N4:2;                  /**< bit:   6..7  Priority of Interrupt 4                  */
    uint32_t :6;                        /**< bit:  8..13  Reserved */
    uint32_t PRI_N5:2;                  /**< bit: 14..15  Priority of Interrupt 5                  */
    uint32_t :6;                        /**< bit: 16..21  Reserved */
    uint32_t PRI_N6:2;                  /**< bit: 22..23  Priority of Interrupt 6                  */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_N7:2;                  /**< bit: 30..31  Priority of Interrupt 7                  */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_IPR1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_IPR1_OFFSET        0x404                                         /**<  (ARM_SYSCTRL_NVIC_IPR1) Interrupt Priority Register 1  Offset */
#define ARM_SYSCTRL_NVIC_IPR1_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_IPR1) Interrupt Priority Register 1  Reset Value */

#define ARM_SYSCTRL_NVIC_IPR1_PRI_N4_Pos    6                                              /**< (ARM_SYSCTRL_NVIC_IPR1) Priority of Interrupt 4 Position */
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N4_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR1_PRI_N4_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR1) Priority of Interrupt 4 Mask */
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N4(value) (ARM_SYSCTRL_NVIC_IPR1_PRI_N4_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR1_PRI_N4_Pos))
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N5_Pos    14                                             /**< (ARM_SYSCTRL_NVIC_IPR1) Priority of Interrupt 5 Position */
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N5_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR1_PRI_N5_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR1) Priority of Interrupt 5 Mask */
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N5(value) (ARM_SYSCTRL_NVIC_IPR1_PRI_N5_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR1_PRI_N5_Pos))
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N6_Pos    22                                             /**< (ARM_SYSCTRL_NVIC_IPR1) Priority of Interrupt 6 Position */
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N6_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR1_PRI_N6_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR1) Priority of Interrupt 6 Mask */
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N6(value) (ARM_SYSCTRL_NVIC_IPR1_PRI_N6_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR1_PRI_N6_Pos))
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N7_Pos    30                                             /**< (ARM_SYSCTRL_NVIC_IPR1) Priority of Interrupt 7 Position */
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N7_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR1_PRI_N7_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR1) Priority of Interrupt 7 Mask */
#define ARM_SYSCTRL_NVIC_IPR1_PRI_N7(value) (ARM_SYSCTRL_NVIC_IPR1_PRI_N7_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR1_PRI_N7_Pos))
#define ARM_SYSCTRL_NVIC_IPR1_MASK          0xC0C0C0C0u                                    /**< \deprecated (ARM_SYSCTRL_NVIC_IPR1) Register MASK  (Use ARM_SYSCTRL_NVIC_IPR1_Msk instead)  */
#define ARM_SYSCTRL_NVIC_IPR1_Msk           0xC0C0C0C0u                                    /**< (ARM_SYSCTRL_NVIC_IPR1) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_IPR2 : (ARM_SYSCTRL Offset: 0x408) (R/W 32) Interrupt Priority Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t PRI_N8:2;                  /**< bit:   6..7  Priority of Interrupt 8                  */
    uint32_t :6;                        /**< bit:  8..13  Reserved */
    uint32_t PRI_N9:2;                  /**< bit: 14..15  Priority of Interrupt 9                  */
    uint32_t :6;                        /**< bit: 16..21  Reserved */
    uint32_t PRI_N10:2;                 /**< bit: 22..23  Priority of Interrupt 10                 */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_N11:2;                 /**< bit: 30..31  Priority of Interrupt 11                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_IPR2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_IPR2_OFFSET        0x408                                         /**<  (ARM_SYSCTRL_NVIC_IPR2) Interrupt Priority Register 2  Offset */
#define ARM_SYSCTRL_NVIC_IPR2_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_IPR2) Interrupt Priority Register 2  Reset Value */

#define ARM_SYSCTRL_NVIC_IPR2_PRI_N8_Pos    6                                              /**< (ARM_SYSCTRL_NVIC_IPR2) Priority of Interrupt 8 Position */
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N8_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR2_PRI_N8_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR2) Priority of Interrupt 8 Mask */
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N8(value) (ARM_SYSCTRL_NVIC_IPR2_PRI_N8_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR2_PRI_N8_Pos))
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N9_Pos    14                                             /**< (ARM_SYSCTRL_NVIC_IPR2) Priority of Interrupt 9 Position */
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N9_Msk    (0x3u << ARM_SYSCTRL_NVIC_IPR2_PRI_N9_Pos)     /**< (ARM_SYSCTRL_NVIC_IPR2) Priority of Interrupt 9 Mask */
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N9(value) (ARM_SYSCTRL_NVIC_IPR2_PRI_N9_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR2_PRI_N9_Pos))
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N10_Pos   22                                             /**< (ARM_SYSCTRL_NVIC_IPR2) Priority of Interrupt 10 Position */
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N10_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR2_PRI_N10_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR2) Priority of Interrupt 10 Mask */
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N10(value) (ARM_SYSCTRL_NVIC_IPR2_PRI_N10_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR2_PRI_N10_Pos))
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N11_Pos   30                                             /**< (ARM_SYSCTRL_NVIC_IPR2) Priority of Interrupt 11 Position */
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N11_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR2_PRI_N11_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR2) Priority of Interrupt 11 Mask */
#define ARM_SYSCTRL_NVIC_IPR2_PRI_N11(value) (ARM_SYSCTRL_NVIC_IPR2_PRI_N11_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR2_PRI_N11_Pos))
#define ARM_SYSCTRL_NVIC_IPR2_MASK          0xC0C0C0C0u                                    /**< \deprecated (ARM_SYSCTRL_NVIC_IPR2) Register MASK  (Use ARM_SYSCTRL_NVIC_IPR2_Msk instead)  */
#define ARM_SYSCTRL_NVIC_IPR2_Msk           0xC0C0C0C0u                                    /**< (ARM_SYSCTRL_NVIC_IPR2) Register Mask  */

