remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
/* -------- ARM_SYSCTRL_NVIC_IPR3 : (ARM_SYSCTRL Offset: 0x40c) (R/W 32) Interrupt Priority Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :6;                        /**< bit:   0..5  Reserved */
    uint32_t PRI_N12:2;                 /**< bit:   6..7  Priority of Interrupt 12                 */
    uint32_t :6;                        /**< bit:  8..13  Reserved */
    uint32_t PRI_N13:2;                 /**< bit: 14..15  Priority of Interrupt 13                 */
    uint32_t :6;                        /**< bit: 16..21  Reserved */
    uint32_t PRI_N14:2;                 /**< bit: 22..23  Priority of Interrupt 14                 */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_N15:2;                 /**< bit: 30..31  Priority of Interrupt 15                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_IPR3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_IPR3_OFFSET        0x40C                                         /**<  (ARM_SYSCTRL_NVIC_IPR3) Interrupt Priority Register 3  Offset */
#define ARM_SYSCTRL_NVIC_IPR3_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_IPR3) Interrupt Priority Register 3  Reset Value */

#define ARM_SYSCTRL_NVIC_IPR3_PRI_N12_Pos   6                                              /**< (ARM_SYSCTRL_NVIC_IPR3) Priority of Interrupt 12 Position */
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N12_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR3_PRI_N12_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR3) Priority of Interrupt 12 Mask */
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N12(value) (ARM_SYSCTRL_NVIC_IPR3_PRI_N12_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR3_PRI_N12_Pos))
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N13_Pos   14                                             /**< (ARM_SYSCTRL_NVIC_IPR3) Priority of Interrupt 13 Position */
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N13_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR3_PRI_N13_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR3) Priority of Interrupt 13 Mask */
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N13(value) (ARM_SYSCTRL_NVIC_IPR3_PRI_N13_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR3_PRI_N13_Pos))
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N14_Pos   22                                             /**< (ARM_SYSCTRL_NVIC_IPR3) Priority of Interrupt 14 Position */
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N14_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR3_PRI_N14_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR3) Priority of Interrupt 14 Mask */
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N14(value) (ARM_SYSCTRL_NVIC_IPR3_PRI_N14_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR3_PRI_N14_Pos))
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N15_Pos   30                                             /**< (ARM_SYSCTRL_NVIC_IPR3) Priority of Interrupt 15 Position */
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N15_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR3_PRI_N15_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR3) Priority of Interrupt 15 Mask */
#define ARM_SYSCTRL_NVIC_IPR3_PRI_N15(value) (ARM_SYSCTRL_NVIC_IPR3_PRI_N15_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR3_PRI_N15_Pos))
#define ARM_SYSCTRL_NVIC_IPR3_MASK          0xC0C0C0C0u                                    /**< \deprecated (ARM_SYSCTRL_NVIC_IPR3) Register MASK  (Use ARM_SYSCTRL_NVIC_IPR3_Msk instead)  */
#define ARM_SYSCTRL_NVIC_IPR3_Msk           0xC0C0C0C0u                                    /**< (ARM_SYSCTRL_NVIC_IPR3) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_IPR4 : (ARM_SYSCTRL Offset: 0x410) (R/W 32) Interrupt Priority Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :5;                        /**< bit:   0..4  Reserved */
    uint32_t PRI_N16:3;                 /**< bit:   5..7  Priority of Interrupt 16                 */
    uint32_t :6;                        /**< bit:  8..13  Reserved */
    uint32_t PRI_N17:2;                 /**< bit: 14..15  Priority of Interrupt 17                 */
    uint32_t :6;                        /**< bit: 16..21  Reserved */
    uint32_t PRI_N18:2;                 /**< bit: 22..23  Priority of Interrupt 18                 */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_N19:2;                 /**< bit: 30..31  Priority of Interrupt 19                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_IPR4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_IPR4_OFFSET        0x410                                         /**<  (ARM_SYSCTRL_NVIC_IPR4) Interrupt Priority Register 4  Offset */
#define ARM_SYSCTRL_NVIC_IPR4_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_IPR4) Interrupt Priority Register 4  Reset Value */

#define ARM_SYSCTRL_NVIC_IPR4_PRI_N16_Pos   5                                              /**< (ARM_SYSCTRL_NVIC_IPR4) Priority of Interrupt 16 Position */
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N16_Msk   (0x7u << ARM_SYSCTRL_NVIC_IPR4_PRI_N16_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR4) Priority of Interrupt 16 Mask */
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N16(value) (ARM_SYSCTRL_NVIC_IPR4_PRI_N16_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR4_PRI_N16_Pos))
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N17_Pos   14                                             /**< (ARM_SYSCTRL_NVIC_IPR4) Priority of Interrupt 17 Position */
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N17_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR4_PRI_N17_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR4) Priority of Interrupt 17 Mask */
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N17(value) (ARM_SYSCTRL_NVIC_IPR4_PRI_N17_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR4_PRI_N17_Pos))
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N18_Pos   22                                             /**< (ARM_SYSCTRL_NVIC_IPR4) Priority of Interrupt 18 Position */
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N18_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR4_PRI_N18_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR4) Priority of Interrupt 18 Mask */
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N18(value) (ARM_SYSCTRL_NVIC_IPR4_PRI_N18_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR4_PRI_N18_Pos))
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N19_Pos   30                                             /**< (ARM_SYSCTRL_NVIC_IPR4) Priority of Interrupt 19 Position */
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N19_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR4_PRI_N19_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR4) Priority of Interrupt 19 Mask */
#define ARM_SYSCTRL_NVIC_IPR4_PRI_N19(value) (ARM_SYSCTRL_NVIC_IPR4_PRI_N19_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR4_PRI_N19_Pos))
#define ARM_SYSCTRL_NVIC_IPR4_MASK          0xC0C0C0E0u                                    /**< \deprecated (ARM_SYSCTRL_NVIC_IPR4) Register MASK  (Use ARM_SYSCTRL_NVIC_IPR4_Msk instead)  */
#define ARM_SYSCTRL_NVIC_IPR4_Msk           0xC0C0C0E0u                                    /**< (ARM_SYSCTRL_NVIC_IPR4) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_IPR5 : (ARM_SYSCTRL Offset: 0x414) (R/W 32) Interrupt Priority Register 5 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :5;                        /**< bit:   0..4  Reserved */
    uint32_t PRI_N20:3;                 /**< bit:   5..7  Priority of Interrupt 20                 */
    uint32_t :6;                        /**< bit:  8..13  Reserved */
    uint32_t PRI_N21:2;                 /**< bit: 14..15  Priority of Interrupt 21                 */
    uint32_t :6;                        /**< bit: 16..21  Reserved */
    uint32_t PRI_N22:2;                 /**< bit: 22..23  Priority of Interrupt 22                 */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_N23:2;                 /**< bit: 30..31  Priority of Interrupt 23                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_IPR5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_IPR5_OFFSET        0x414                                         /**<  (ARM_SYSCTRL_NVIC_IPR5) Interrupt Priority Register 5  Offset */
#define ARM_SYSCTRL_NVIC_IPR5_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_IPR5) Interrupt Priority Register 5  Reset Value */

