remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N20_Pos   5                                              /**< (ARM_SYSCTRL_NVIC_IPR5) Priority of Interrupt 20 Position */
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N20_Msk   (0x7u << ARM_SYSCTRL_NVIC_IPR5_PRI_N20_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR5) Priority of Interrupt 20 Mask */
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N20(value) (ARM_SYSCTRL_NVIC_IPR5_PRI_N20_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR5_PRI_N20_Pos))
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N21_Pos   14                                             /**< (ARM_SYSCTRL_NVIC_IPR5) Priority of Interrupt 21 Position */
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N21_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR5_PRI_N21_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR5) Priority of Interrupt 21 Mask */
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N21(value) (ARM_SYSCTRL_NVIC_IPR5_PRI_N21_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR5_PRI_N21_Pos))
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N22_Pos   22                                             /**< (ARM_SYSCTRL_NVIC_IPR5) Priority of Interrupt 22 Position */
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N22_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR5_PRI_N22_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR5) Priority of Interrupt 22 Mask */
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N22(value) (ARM_SYSCTRL_NVIC_IPR5_PRI_N22_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR5_PRI_N22_Pos))
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N23_Pos   30                                             /**< (ARM_SYSCTRL_NVIC_IPR5) Priority of Interrupt 23 Position */
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N23_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR5_PRI_N23_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR5) Priority of Interrupt 23 Mask */
#define ARM_SYSCTRL_NVIC_IPR5_PRI_N23(value) (ARM_SYSCTRL_NVIC_IPR5_PRI_N23_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR5_PRI_N23_Pos))
#define ARM_SYSCTRL_NVIC_IPR5_MASK          0xC0C0C0E0u                                    /**< \deprecated (ARM_SYSCTRL_NVIC_IPR5) Register MASK  (Use ARM_SYSCTRL_NVIC_IPR5_Msk instead)  */
#define ARM_SYSCTRL_NVIC_IPR5_Msk           0xC0C0C0E0u                                    /**< (ARM_SYSCTRL_NVIC_IPR5) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_IPR6 : (ARM_SYSCTRL Offset: 0x418) (R/W 32) Interrupt Priority Register 6 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :5;                        /**< bit:   0..4  Reserved */
    uint32_t PRI_N24:3;                 /**< bit:   5..7  Priority of Interrupt 24                 */
    uint32_t :6;                        /**< bit:  8..13  Reserved */
    uint32_t PRI_N25:2;                 /**< bit: 14..15  Priority of Interrupt 25                 */
    uint32_t :6;                        /**< bit: 16..21  Reserved */
    uint32_t PRI_N26:2;                 /**< bit: 22..23  Priority of Interrupt 26                 */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_N27:2;                 /**< bit: 30..31  Priority of Interrupt 27                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_IPR6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_IPR6_OFFSET        0x418                                         /**<  (ARM_SYSCTRL_NVIC_IPR6) Interrupt Priority Register 6  Offset */
#define ARM_SYSCTRL_NVIC_IPR6_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_IPR6) Interrupt Priority Register 6  Reset Value */

#define ARM_SYSCTRL_NVIC_IPR6_PRI_N24_Pos   5                                              /**< (ARM_SYSCTRL_NVIC_IPR6) Priority of Interrupt 24 Position */
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N24_Msk   (0x7u << ARM_SYSCTRL_NVIC_IPR6_PRI_N24_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR6) Priority of Interrupt 24 Mask */
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N24(value) (ARM_SYSCTRL_NVIC_IPR6_PRI_N24_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR6_PRI_N24_Pos))
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N25_Pos   14                                             /**< (ARM_SYSCTRL_NVIC_IPR6) Priority of Interrupt 25 Position */
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N25_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR6_PRI_N25_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR6) Priority of Interrupt 25 Mask */
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N25(value) (ARM_SYSCTRL_NVIC_IPR6_PRI_N25_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR6_PRI_N25_Pos))
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N26_Pos   22                                             /**< (ARM_SYSCTRL_NVIC_IPR6) Priority of Interrupt 26 Position */
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N26_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR6_PRI_N26_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR6) Priority of Interrupt 26 Mask */
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N26(value) (ARM_SYSCTRL_NVIC_IPR6_PRI_N26_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR6_PRI_N26_Pos))
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N27_Pos   30                                             /**< (ARM_SYSCTRL_NVIC_IPR6) Priority of Interrupt 27 Position */
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N27_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR6_PRI_N27_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR6) Priority of Interrupt 27 Mask */
#define ARM_SYSCTRL_NVIC_IPR6_PRI_N27(value) (ARM_SYSCTRL_NVIC_IPR6_PRI_N27_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR6_PRI_N27_Pos))
#define ARM_SYSCTRL_NVIC_IPR6_MASK          0xC0C0C0E0u                                    /**< \deprecated (ARM_SYSCTRL_NVIC_IPR6) Register MASK  (Use ARM_SYSCTRL_NVIC_IPR6_Msk instead)  */
#define ARM_SYSCTRL_NVIC_IPR6_Msk           0xC0C0C0E0u                                    /**< (ARM_SYSCTRL_NVIC_IPR6) Register Mask  */

/* -------- ARM_SYSCTRL_NVIC_IPR7 : (ARM_SYSCTRL Offset: 0x41c) (R/W 32) Interrupt Priority Register 7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :5;                        /**< bit:   0..4  Reserved */
    uint32_t PRI_N28:3;                 /**< bit:   5..7  Priority of Interrupt 28                 */
    uint32_t :6;                        /**< bit:  8..13  Reserved */
    uint32_t PRI_N29:2;                 /**< bit: 14..15  Priority of Interrupt 29                 */
    uint32_t :6;                        /**< bit: 16..21  Reserved */
    uint32_t PRI_N30:2;                 /**< bit: 22..23  Priority of Interrupt 30                 */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_N31:2;                 /**< bit: 30..31  Priority of Interrupt 31                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_NVIC_IPR7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_NVIC_IPR7_OFFSET        0x41C                                         /**<  (ARM_SYSCTRL_NVIC_IPR7) Interrupt Priority Register 7  Offset */
#define ARM_SYSCTRL_NVIC_IPR7_RESETVALUE    0x00u                                         /**<  (ARM_SYSCTRL_NVIC_IPR7) Interrupt Priority Register 7  Reset Value */

#define ARM_SYSCTRL_NVIC_IPR7_PRI_N28_Pos   5                                              /**< (ARM_SYSCTRL_NVIC_IPR7) Priority of Interrupt 28 Position */
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N28_Msk   (0x7u << ARM_SYSCTRL_NVIC_IPR7_PRI_N28_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR7) Priority of Interrupt 28 Mask */
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N28(value) (ARM_SYSCTRL_NVIC_IPR7_PRI_N28_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR7_PRI_N28_Pos))
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N29_Pos   14                                             /**< (ARM_SYSCTRL_NVIC_IPR7) Priority of Interrupt 29 Position */
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N29_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR7_PRI_N29_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR7) Priority of Interrupt 29 Mask */
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N29(value) (ARM_SYSCTRL_NVIC_IPR7_PRI_N29_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR7_PRI_N29_Pos))
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N30_Pos   22                                             /**< (ARM_SYSCTRL_NVIC_IPR7) Priority of Interrupt 30 Position */
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N30_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR7_PRI_N30_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR7) Priority of Interrupt 30 Mask */
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N30(value) (ARM_SYSCTRL_NVIC_IPR7_PRI_N30_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR7_PRI_N30_Pos))
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N31_Pos   30                                             /**< (ARM_SYSCTRL_NVIC_IPR7) Priority of Interrupt 31 Position */
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N31_Msk   (0x3u << ARM_SYSCTRL_NVIC_IPR7_PRI_N31_Pos)    /**< (ARM_SYSCTRL_NVIC_IPR7) Priority of Interrupt 31 Mask */
#define ARM_SYSCTRL_NVIC_IPR7_PRI_N31(value) (ARM_SYSCTRL_NVIC_IPR7_PRI_N31_Msk & ((value) << ARM_SYSCTRL_NVIC_IPR7_PRI_N31_Pos))
#define ARM_SYSCTRL_NVIC_IPR7_MASK          0xC0C0C0E0u                                    /**< \deprecated (ARM_SYSCTRL_NVIC_IPR7) Register MASK  (Use ARM_SYSCTRL_NVIC_IPR7_Msk instead)  */
#define ARM_SYSCTRL_NVIC_IPR7_Msk           0xC0C0C0E0u                                    /**< (ARM_SYSCTRL_NVIC_IPR7) Register Mask  */

/* -------- ARM_SYSCTRL_CPUID : (ARM_SYSCTRL Offset: 0xd00) (R/ 32) CPU Identification Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CPUID:32;                  /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_CPUID_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_CPUID_OFFSET            0xD00                                         /**<  (ARM_SYSCTRL_CPUID) CPU Identification Register  Offset */
#define ARM_SYSCTRL_CPUID_RESETVALUE        0x410CC200u                                   /**<  (ARM_SYSCTRL_CPUID) CPU Identification Register  Reset Value */

#define ARM_SYSCTRL_CPUID_CPUID_Pos         0                                              /**< (ARM_SYSCTRL_CPUID)  Position */
#define ARM_SYSCTRL_CPUID_CPUID_Msk         (0xFFFFFFFFu << ARM_SYSCTRL_CPUID_CPUID_Pos)   /**< (ARM_SYSCTRL_CPUID)  Mask */
#define ARM_SYSCTRL_CPUID_CPUID(value)      (ARM_SYSCTRL_CPUID_CPUID_Msk & ((value) << ARM_SYSCTRL_CPUID_CPUID_Pos))
#define ARM_SYSCTRL_CPUID_MASK              0xFFFFFFFFu                                    /**< \deprecated (ARM_SYSCTRL_CPUID) Register MASK  (Use ARM_SYSCTRL_CPUID_Msk instead)  */
#define ARM_SYSCTRL_CPUID_Msk               0xFFFFFFFFu                                    /**< (ARM_SYSCTRL_CPUID) Register Mask  */

/* -------- ARM_SYSCTRL_ICSR : (ARM_SYSCTRL Offset: 0xd04) (R/ 32) Interrupt Control State Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t VECTACTIVE:9;              /**< bit:   0..8  Exception number for the current executing exception */
    uint32_t :3;                        /**< bit:  9..11  Reserved */
    uint32_t VECTPENDING:9;             /**< bit: 12..20  Exception number for highest priority pending exception */
    uint32_t :1;                        /**< bit:     21  Reserved */
    uint32_t ISRPENDING:1;              /**< bit:     22  If 1, Interrupt is pending               */
    uint32_t ISRPREEMPT:1;              /**< bit:     23  If 1, will service a pending exception   */
    uint32_t :1;                        /**< bit:     24  Reserved */
    uint32_t PENDSTCLR:1;               /**< bit:     25  Clear Pending SysTick                    */
    uint32_t PENDSTSET:1;               /**< bit:     26  Set pending SysTick                      */
    uint32_t PENDSVCLR:1;               /**< bit:     27  Clearing pending PendSV                  */
    uint32_t PENDSVSET:1;               /**< bit:     28  Set pending PendSV interrupt             */
    uint32_t :2;                        /**< bit: 29..30  Reserved */
    uint32_t NMIPENDSET:1;              /**< bit:     31  Activate NMI Exception                   */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_ICSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_ICSR_OFFSET             0xD04                                         /**<  (ARM_SYSCTRL_ICSR) Interrupt Control State Register  Offset */
#define ARM_SYSCTRL_ICSR_RESETVALUE         0x00u                                         /**<  (ARM_SYSCTRL_ICSR) Interrupt Control State Register  Reset Value */

#define ARM_SYSCTRL_ICSR_VECTACTIVE_Pos     0                                              /**< (ARM_SYSCTRL_ICSR) Exception number for the current executing exception Position */
#define ARM_SYSCTRL_ICSR_VECTACTIVE_Msk     (0x1FFu << ARM_SYSCTRL_ICSR_VECTACTIVE_Pos)    /**< (ARM_SYSCTRL_ICSR) Exception number for the current executing exception Mask */
#define ARM_SYSCTRL_ICSR_VECTACTIVE(value)  (ARM_SYSCTRL_ICSR_VECTACTIVE_Msk & ((value) << ARM_SYSCTRL_ICSR_VECTACTIVE_Pos))
#define ARM_SYSCTRL_ICSR_VECTPENDING_Pos    12                                             /**< (ARM_SYSCTRL_ICSR) Exception number for highest priority pending exception Position */
#define ARM_SYSCTRL_ICSR_VECTPENDING_Msk    (0x1FFu << ARM_SYSCTRL_ICSR_VECTPENDING_Pos)   /**< (ARM_SYSCTRL_ICSR) Exception number for highest priority pending exception Mask */
#define ARM_SYSCTRL_ICSR_VECTPENDING(value) (ARM_SYSCTRL_ICSR_VECTPENDING_Msk & ((value) << ARM_SYSCTRL_ICSR_VECTPENDING_Pos))
#define ARM_SYSCTRL_ICSR_ISRPENDING_Pos     22                                             /**< (ARM_SYSCTRL_ICSR) If 1, Interrupt is pending Position */
#define ARM_SYSCTRL_ICSR_ISRPENDING_Msk     (0x1u << ARM_SYSCTRL_ICSR_ISRPENDING_Pos)      /**< (ARM_SYSCTRL_ICSR) If 1, Interrupt is pending Mask */
#define ARM_SYSCTRL_ICSR_ISRPENDING         ARM_SYSCTRL_ICSR_ISRPENDING_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_ICSR_ISRPENDING_Msk instead */
#define ARM_SYSCTRL_ICSR_ISRPREEMPT_Pos     23                                             /**< (ARM_SYSCTRL_ICSR) If 1, will service a pending exception Position */
#define ARM_SYSCTRL_ICSR_ISRPREEMPT_Msk     (0x1u << ARM_SYSCTRL_ICSR_ISRPREEMPT_Pos)      /**< (ARM_SYSCTRL_ICSR) If 1, will service a pending exception Mask */
#define ARM_SYSCTRL_ICSR_ISRPREEMPT         ARM_SYSCTRL_ICSR_ISRPREEMPT_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_ICSR_ISRPREEMPT_Msk instead */
#define ARM_SYSCTRL_ICSR_PENDSTCLR_Pos      25                                             /**< (ARM_SYSCTRL_ICSR) Clear Pending SysTick Position */
#define ARM_SYSCTRL_ICSR_PENDSTCLR_Msk      (0x1u << ARM_SYSCTRL_ICSR_PENDSTCLR_Pos)       /**< (ARM_SYSCTRL_ICSR) Clear Pending SysTick Mask */
#define ARM_SYSCTRL_ICSR_PENDSTCLR          ARM_SYSCTRL_ICSR_PENDSTCLR_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_ICSR_PENDSTCLR_Msk instead */
#define ARM_SYSCTRL_ICSR_PENDSTSET_Pos      26                                             /**< (ARM_SYSCTRL_ICSR) Set pending SysTick Position */
#define ARM_SYSCTRL_ICSR_PENDSTSET_Msk      (0x1u << ARM_SYSCTRL_ICSR_PENDSTSET_Pos)       /**< (ARM_SYSCTRL_ICSR) Set pending SysTick Mask */
#define ARM_SYSCTRL_ICSR_PENDSTSET          ARM_SYSCTRL_ICSR_PENDSTSET_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_ICSR_PENDSTSET_Msk instead */
#define ARM_SYSCTRL_ICSR_PENDSVCLR_Pos      27                                             /**< (ARM_SYSCTRL_ICSR) Clearing pending PendSV Position */
#define ARM_SYSCTRL_ICSR_PENDSVCLR_Msk      (0x1u << ARM_SYSCTRL_ICSR_PENDSVCLR_Pos)       /**< (ARM_SYSCTRL_ICSR) Clearing pending PendSV Mask */
#define ARM_SYSCTRL_ICSR_PENDSVCLR          ARM_SYSCTRL_ICSR_PENDSVCLR_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_ICSR_PENDSVCLR_Msk instead */
#define ARM_SYSCTRL_ICSR_PENDSVSET_Pos      28                                             /**< (ARM_SYSCTRL_ICSR) Set pending PendSV interrupt Position */
#define ARM_SYSCTRL_ICSR_PENDSVSET_Msk      (0x1u << ARM_SYSCTRL_ICSR_PENDSVSET_Pos)       /**< (ARM_SYSCTRL_ICSR) Set pending PendSV interrupt Mask */
#define ARM_SYSCTRL_ICSR_PENDSVSET          ARM_SYSCTRL_ICSR_PENDSVSET_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_ICSR_PENDSVSET_Msk instead */
#define ARM_SYSCTRL_ICSR_NMIPENDSET_Pos     31                                             /**< (ARM_SYSCTRL_ICSR) Activate NMI Exception Position */
#define ARM_SYSCTRL_ICSR_NMIPENDSET_Msk     (0x1u << ARM_SYSCTRL_ICSR_NMIPENDSET_Pos)      /**< (ARM_SYSCTRL_ICSR) Activate NMI Exception Mask */
#define ARM_SYSCTRL_ICSR_NMIPENDSET         ARM_SYSCTRL_ICSR_NMIPENDSET_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_ICSR_NMIPENDSET_Msk instead */
#define ARM_SYSCTRL_ICSR_MASK               0x9EDFF1FFu                                    /**< \deprecated (ARM_SYSCTRL_ICSR) Register MASK  (Use ARM_SYSCTRL_ICSR_Msk instead)  */
#define ARM_SYSCTRL_ICSR_Msk                0x9EDFF1FFu                                    /**< (ARM_SYSCTRL_ICSR) Register Mask  */

/* -------- ARM_SYSCTRL_AIRCR : (ARM_SYSCTRL Offset: 0xd0c) (R/ 32) Application Interrupt and Reset Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t VECTCLRACTIVE:1;           /**< bit:      1  Clears all active state information for fixed and configurable exceptions */
    uint32_t SYSRESETREQ:1;             /**< bit:      2  Active High System Reset Request         */
    uint32_t :12;                       /**< bit:  3..14  Reserved */
    uint32_t ENDIANNESS:1;              /**< bit:     15  If 1 then big endian                     */
    uint32_t VECTKEY:16;                /**< bit: 16..31  Vector Key, must write 0x05FA to this otherwise the write is UNPREDICTABLE */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_AIRCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_AIRCR_OFFSET            0xD0C                                         /**<  (ARM_SYSCTRL_AIRCR) Application Interrupt and Reset Control Register  Offset */
#define ARM_SYSCTRL_AIRCR_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_AIRCR) Application Interrupt and Reset Control Register  Reset Value */

#define ARM_SYSCTRL_AIRCR_VECTCLRACTIVE_Pos 1                                              /**< (ARM_SYSCTRL_AIRCR) Clears all active state information for fixed and configurable exceptions Position */
#define ARM_SYSCTRL_AIRCR_VECTCLRACTIVE_Msk (0x1u << ARM_SYSCTRL_AIRCR_VECTCLRACTIVE_Pos)  /**< (ARM_SYSCTRL_AIRCR) Clears all active state information for fixed and configurable exceptions Mask */
#define ARM_SYSCTRL_AIRCR_VECTCLRACTIVE     ARM_SYSCTRL_AIRCR_VECTCLRACTIVE_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_AIRCR_VECTCLRACTIVE_Msk instead */
#define ARM_SYSCTRL_AIRCR_SYSRESETREQ_Pos   2                                              /**< (ARM_SYSCTRL_AIRCR) Active High System Reset Request Position */
#define ARM_SYSCTRL_AIRCR_SYSRESETREQ_Msk   (0x1u << ARM_SYSCTRL_AIRCR_SYSRESETREQ_Pos)    /**< (ARM_SYSCTRL_AIRCR) Active High System Reset Request Mask */
#define ARM_SYSCTRL_AIRCR_SYSRESETREQ       ARM_SYSCTRL_AIRCR_SYSRESETREQ_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_AIRCR_SYSRESETREQ_Msk instead */
#define ARM_SYSCTRL_AIRCR_ENDIANNESS_Pos    15                                             /**< (ARM_SYSCTRL_AIRCR) If 1 then big endian Position */
#define ARM_SYSCTRL_AIRCR_ENDIANNESS_Msk    (0x1u << ARM_SYSCTRL_AIRCR_ENDIANNESS_Pos)     /**< (ARM_SYSCTRL_AIRCR) If 1 then big endian Mask */
#define ARM_SYSCTRL_AIRCR_ENDIANNESS        ARM_SYSCTRL_AIRCR_ENDIANNESS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_AIRCR_ENDIANNESS_Msk instead */
#define ARM_SYSCTRL_AIRCR_VECTKEY_Pos       16                                             /**< (ARM_SYSCTRL_AIRCR) Vector Key, must write 0x05FA to this otherwise the write is UNPREDICTABLE Position */
#define ARM_SYSCTRL_AIRCR_VECTKEY_Msk       (0xFFFFu << ARM_SYSCTRL_AIRCR_VECTKEY_Pos)     /**< (ARM_SYSCTRL_AIRCR) Vector Key, must write 0x05FA to this otherwise the write is UNPREDICTABLE Mask */
#define ARM_SYSCTRL_AIRCR_VECTKEY(value)    (ARM_SYSCTRL_AIRCR_VECTKEY_Msk & ((value) << ARM_SYSCTRL_AIRCR_VECTKEY_Pos))
#define ARM_SYSCTRL_AIRCR_MASK              0xFFFF8006u                                    /**< \deprecated (ARM_SYSCTRL_AIRCR) Register MASK  (Use ARM_SYSCTRL_AIRCR_Msk instead)  */
#define ARM_SYSCTRL_AIRCR_Msk               0xFFFF8006u                                    /**< (ARM_SYSCTRL_AIRCR) Register Mask  */

/* -------- ARM_SYSCTRL_SCR : (ARM_SYSCTRL Offset: 0xd10) (R/W 8) System Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  :1;                        /**< bit:      0  Reserved */
    uint8_t  SLEEPONEXIT:1;             /**< bit:      1  Enter sleep state on exit from an ISR    */
    uint8_t  SLEEPDEEP:1;               /**< bit:      2  Selected sleep state is deep sleep       */
    uint8_t  :1;                        /**< bit:      3  Reserved */
    uint8_t  SEVONPEND:1;               /**< bit:      4  Transitions from inactive to pending are wakeup events */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCR_OFFSET              0xD10                                         /**<  (ARM_SYSCTRL_SCR) System Control Register  Offset */
#define ARM_SYSCTRL_SCR_RESETVALUE          0x00u                                         /**<  (ARM_SYSCTRL_SCR) System Control Register  Reset Value */

