remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#define ARM_SYSCTRL_SCR_SLEEPONEXIT_Pos     1                                              /**< (ARM_SYSCTRL_SCR) Enter sleep state on exit from an ISR Position */
#define ARM_SYSCTRL_SCR_SLEEPONEXIT_Msk     (0x1u << ARM_SYSCTRL_SCR_SLEEPONEXIT_Pos)      /**< (ARM_SYSCTRL_SCR) Enter sleep state on exit from an ISR Mask */
#define ARM_SYSCTRL_SCR_SLEEPONEXIT         ARM_SYSCTRL_SCR_SLEEPONEXIT_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SCR_SLEEPONEXIT_Msk instead */
#define ARM_SYSCTRL_SCR_SLEEPDEEP_Pos       2                                              /**< (ARM_SYSCTRL_SCR) Selected sleep state is deep sleep Position */
#define ARM_SYSCTRL_SCR_SLEEPDEEP_Msk       (0x1u << ARM_SYSCTRL_SCR_SLEEPDEEP_Pos)        /**< (ARM_SYSCTRL_SCR) Selected sleep state is deep sleep Mask */
#define ARM_SYSCTRL_SCR_SLEEPDEEP           ARM_SYSCTRL_SCR_SLEEPDEEP_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SCR_SLEEPDEEP_Msk instead */
#define ARM_SYSCTRL_SCR_SEVONPEND_Pos       4                                              /**< (ARM_SYSCTRL_SCR) Transitions from inactive to pending are wakeup events Position */
#define ARM_SYSCTRL_SCR_SEVONPEND_Msk       (0x1u << ARM_SYSCTRL_SCR_SEVONPEND_Pos)        /**< (ARM_SYSCTRL_SCR) Transitions from inactive to pending are wakeup events Mask */
#define ARM_SYSCTRL_SCR_SEVONPEND           ARM_SYSCTRL_SCR_SEVONPEND_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SCR_SEVONPEND_Msk instead */
#define ARM_SYSCTRL_SCR_MASK                0x16u                                          /**< \deprecated (ARM_SYSCTRL_SCR) Register MASK  (Use ARM_SYSCTRL_SCR_Msk instead)  */
#define ARM_SYSCTRL_SCR_Msk                 0x16u                                          /**< (ARM_SYSCTRL_SCR) Register Mask  */

/* -------- ARM_SYSCTRL_CCR : (ARM_SYSCTRL Offset: 0xd14) (R/ 16) Configuration and Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t :3;                        /**< bit:   0..2  Reserved */
    uint16_t UNALIGN_TRP:1;             /**< bit:      3  Unaligned work and halfword accesses generate a HardFault exception */
    uint16_t :5;                        /**< bit:   4..8  Reserved */
    uint16_t STKALIGN:1;                /**< bit:      9  On exception entry, SP used prior to exception is adjusted to be 8-byte aligned and context to restore it is saved */
    uint16_t :6;                        /**< bit: 10..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_CCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_CCR_OFFSET              0xD14                                         /**<  (ARM_SYSCTRL_CCR) Configuration and Control Register  Offset */
#define ARM_SYSCTRL_CCR_RESETVALUE          0x00u                                         /**<  (ARM_SYSCTRL_CCR) Configuration and Control Register  Reset Value */

#define ARM_SYSCTRL_CCR_UNALIGN_TRP_Pos     3                                              /**< (ARM_SYSCTRL_CCR) Unaligned work and halfword accesses generate a HardFault exception Position */
#define ARM_SYSCTRL_CCR_UNALIGN_TRP_Msk     (0x1u << ARM_SYSCTRL_CCR_UNALIGN_TRP_Pos)      /**< (ARM_SYSCTRL_CCR) Unaligned work and halfword accesses generate a HardFault exception Mask */
#define ARM_SYSCTRL_CCR_UNALIGN_TRP         ARM_SYSCTRL_CCR_UNALIGN_TRP_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_CCR_UNALIGN_TRP_Msk instead */
#define ARM_SYSCTRL_CCR_STKALIGN_Pos        9                                              /**< (ARM_SYSCTRL_CCR) On exception entry, SP used prior to exception is adjusted to be 8-byte aligned and context to restore it is saved Position */
#define ARM_SYSCTRL_CCR_STKALIGN_Msk        (0x1u << ARM_SYSCTRL_CCR_STKALIGN_Pos)         /**< (ARM_SYSCTRL_CCR) On exception entry, SP used prior to exception is adjusted to be 8-byte aligned and context to restore it is saved Mask */
#define ARM_SYSCTRL_CCR_STKALIGN            ARM_SYSCTRL_CCR_STKALIGN_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_CCR_STKALIGN_Msk instead */
#define ARM_SYSCTRL_CCR_MASK                0x208u                                         /**< \deprecated (ARM_SYSCTRL_CCR) Register MASK  (Use ARM_SYSCTRL_CCR_Msk instead)  */
#define ARM_SYSCTRL_CCR_Msk                 0x208u                                         /**< (ARM_SYSCTRL_CCR) Register Mask  */

/* -------- ARM_SYSCTRL_SHPR2 : (ARM_SYSCTRL Offset: 0xd1c) (R/W 32) System Handler Priority Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :30;                       /**< bit:  0..29  Reserved */
    uint32_t PRI_11:2;                  /**< bit: 30..31  Priority of system handler 11, SVCall    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SHPR2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SHPR2_OFFSET            0xD1C                                         /**<  (ARM_SYSCTRL_SHPR2) System Handler Priority Register 2  Offset */
#define ARM_SYSCTRL_SHPR2_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_SHPR2) System Handler Priority Register 2  Reset Value */

#define ARM_SYSCTRL_SHPR2_PRI_11_Pos        30                                             /**< (ARM_SYSCTRL_SHPR2) Priority of system handler 11, SVCall Position */
#define ARM_SYSCTRL_SHPR2_PRI_11_Msk        (0x3u << ARM_SYSCTRL_SHPR2_PRI_11_Pos)         /**< (ARM_SYSCTRL_SHPR2) Priority of system handler 11, SVCall Mask */
#define ARM_SYSCTRL_SHPR2_PRI_11(value)     (ARM_SYSCTRL_SHPR2_PRI_11_Msk & ((value) << ARM_SYSCTRL_SHPR2_PRI_11_Pos))
#define ARM_SYSCTRL_SHPR2_MASK              0xC0000000u                                    /**< \deprecated (ARM_SYSCTRL_SHPR2) Register MASK  (Use ARM_SYSCTRL_SHPR2_Msk instead)  */
#define ARM_SYSCTRL_SHPR2_Msk               0xC0000000u                                    /**< (ARM_SYSCTRL_SHPR2) Register Mask  */

/* -------- ARM_SYSCTRL_SHPR3 : (ARM_SYSCTRL Offset: 0xd20) (R/W 32) System Handler Priority Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :22;                       /**< bit:   0..21  Reserved */
    uint32_t PRI_14:2;                  /**< bit:  22..23  Priority of system handler 14, PendSV    */
    uint32_t :6;                        /**< bit: 24..29  Reserved */
    uint32_t PRI_15:2;                  /**< bit: 30..31  Priority of system handler 15, SysTick   */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SHPR3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SHPR3_OFFSET            0xD20                                         /**<  (ARM_SYSCTRL_SHPR3) System Handler Priority Register 3  Offset */
#define ARM_SYSCTRL_SHPR3_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_SHPR3) System Handler Priority Register 3  Reset Value */

