remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#define ARM_SYSCTRL_SHPR3_PRI_14_Pos        2                                              /**< (ARM_SYSCTRL_SHPR3) Priority of system handler 14, PendSV Position */
#define ARM_SYSCTRL_SHPR3_PRI_14_Msk        (0x3FFFFFu << ARM_SYSCTRL_SHPR3_PRI_14_Pos)    /**< (ARM_SYSCTRL_SHPR3) Priority of system handler 14, PendSV Mask */
#define ARM_SYSCTRL_SHPR3_PRI_14(value)     (ARM_SYSCTRL_SHPR3_PRI_14_Msk & ((value) << ARM_SYSCTRL_SHPR3_PRI_14_Pos))
#define ARM_SYSCTRL_SHPR3_PRI_15_Pos        30                                             /**< (ARM_SYSCTRL_SHPR3) Priority of system handler 15, SysTick Position */
#define ARM_SYSCTRL_SHPR3_PRI_15_Msk        (0x3u << ARM_SYSCTRL_SHPR3_PRI_15_Pos)         /**< (ARM_SYSCTRL_SHPR3) Priority of system handler 15, SysTick Mask */
#define ARM_SYSCTRL_SHPR3_PRI_15(value)     (ARM_SYSCTRL_SHPR3_PRI_15_Msk & ((value) << ARM_SYSCTRL_SHPR3_PRI_15_Pos))
#define ARM_SYSCTRL_SHPR3_MASK              0xC0FFFFFCu                                    /**< \deprecated (ARM_SYSCTRL_SHPR3) Register MASK  (Use ARM_SYSCTRL_SHPR3_Msk instead)  */
#define ARM_SYSCTRL_SHPR3_Msk               0xC0FFFFFCu                                    /**< (ARM_SYSCTRL_SHPR3) Register Mask  */

/* -------- ARM_SYSCTRL_SHCSR : (ARM_SYSCTRL Offset: 0xd24) (R/W 16) System Handler Control and State Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t :15;                       /**< bit:  0..14  Reserved */
    uint16_t SVCALLPENDED:1;            /**< bit:     15  SVCall is pending                        */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SHCSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SHCSR_OFFSET            0xD24                                         /**<  (ARM_SYSCTRL_SHCSR) System Handler Control and State Register  Offset */
#define ARM_SYSCTRL_SHCSR_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_SHCSR) System Handler Control and State Register  Reset Value */

#define ARM_SYSCTRL_SHCSR_SVCALLPENDED_Pos  15                                             /**< (ARM_SYSCTRL_SHCSR) SVCall is pending Position */
#define ARM_SYSCTRL_SHCSR_SVCALLPENDED_Msk  (0x1u << ARM_SYSCTRL_SHCSR_SVCALLPENDED_Pos)   /**< (ARM_SYSCTRL_SHCSR) SVCall is pending Mask */
#define ARM_SYSCTRL_SHCSR_SVCALLPENDED      ARM_SYSCTRL_SHCSR_SVCALLPENDED_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SHCSR_SVCALLPENDED_Msk instead */
#define ARM_SYSCTRL_SHCSR_MASK              0x8000u                                        /**< \deprecated (ARM_SYSCTRL_SHCSR) Register MASK  (Use ARM_SYSCTRL_SHCSR_Msk instead)  */
#define ARM_SYSCTRL_SHCSR_Msk               0x8000u                                        /**< (ARM_SYSCTRL_SHCSR) Register Mask  */

/* -------- ARM_SYSCTRL_DFSR : (ARM_SYSCTRL Offset: 0xd30) (R/W 8) Debug Fault Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  HALTED:1;                  /**< bit:      0  Halt Request Debug Event Active          */
    uint8_t  BKPT:1;                    /**< bit:      1  At least one breakpoint debug event      */
    uint8_t  DWTTRAP:1;                 /**< bit:      2  At least one debug event generated by DWT */
    uint8_t  VCATCH:1;                  /**< bit:      3  Vector catch debug event generated       */
    uint8_t  EXTERNAL:1;                /**< bit:      4  EDBGRQ debug event                       */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_DFSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_DFSR_OFFSET             0xD30                                         /**<  (ARM_SYSCTRL_DFSR) Debug Fault Status Register  Offset */
#define ARM_SYSCTRL_DFSR_RESETVALUE         0x00u                                         /**<  (ARM_SYSCTRL_DFSR) Debug Fault Status Register  Reset Value */

#define ARM_SYSCTRL_DFSR_HALTED_Pos         0                                              /**< (ARM_SYSCTRL_DFSR) Halt Request Debug Event Active Position */
#define ARM_SYSCTRL_DFSR_HALTED_Msk         (0x1u << ARM_SYSCTRL_DFSR_HALTED_Pos)          /**< (ARM_SYSCTRL_DFSR) Halt Request Debug Event Active Mask */
#define ARM_SYSCTRL_DFSR_HALTED             ARM_SYSCTRL_DFSR_HALTED_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DFSR_HALTED_Msk instead */
#define ARM_SYSCTRL_DFSR_BKPT_Pos           1                                              /**< (ARM_SYSCTRL_DFSR) At least one breakpoint debug event Position */
#define ARM_SYSCTRL_DFSR_BKPT_Msk           (0x1u << ARM_SYSCTRL_DFSR_BKPT_Pos)            /**< (ARM_SYSCTRL_DFSR) At least one breakpoint debug event Mask */
#define ARM_SYSCTRL_DFSR_BKPT               ARM_SYSCTRL_DFSR_BKPT_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DFSR_BKPT_Msk instead */
#define ARM_SYSCTRL_DFSR_DWTTRAP_Pos        2                                              /**< (ARM_SYSCTRL_DFSR) At least one debug event generated by DWT Position */
#define ARM_SYSCTRL_DFSR_DWTTRAP_Msk        (0x1u << ARM_SYSCTRL_DFSR_DWTTRAP_Pos)         /**< (ARM_SYSCTRL_DFSR) At least one debug event generated by DWT Mask */
#define ARM_SYSCTRL_DFSR_DWTTRAP            ARM_SYSCTRL_DFSR_DWTTRAP_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DFSR_DWTTRAP_Msk instead */
#define ARM_SYSCTRL_DFSR_VCATCH_Pos         3                                              /**< (ARM_SYSCTRL_DFSR) Vector catch debug event generated Position */
#define ARM_SYSCTRL_DFSR_VCATCH_Msk         (0x1u << ARM_SYSCTRL_DFSR_VCATCH_Pos)          /**< (ARM_SYSCTRL_DFSR) Vector catch debug event generated Mask */
#define ARM_SYSCTRL_DFSR_VCATCH             ARM_SYSCTRL_DFSR_VCATCH_Msk                    /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DFSR_VCATCH_Msk instead */
#define ARM_SYSCTRL_DFSR_EXTERNAL_Pos       4                                              /**< (ARM_SYSCTRL_DFSR) EDBGRQ debug event Position */
#define ARM_SYSCTRL_DFSR_EXTERNAL_Msk       (0x1u << ARM_SYSCTRL_DFSR_EXTERNAL_Pos)        /**< (ARM_SYSCTRL_DFSR) EDBGRQ debug event Mask */
#define ARM_SYSCTRL_DFSR_EXTERNAL           ARM_SYSCTRL_DFSR_EXTERNAL_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DFSR_EXTERNAL_Msk instead */
#define ARM_SYSCTRL_DFSR_MASK               0x1Fu                                          /**< \deprecated (ARM_SYSCTRL_DFSR) Register MASK  (Use ARM_SYSCTRL_DFSR_Msk instead)  */
#define ARM_SYSCTRL_DFSR_Msk                0x1Fu                                          /**< (ARM_SYSCTRL_DFSR) Register Mask  */

