remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
/* -------- ARM_SYSCTRL_DHCSR : (ARM_SYSCTRL Offset: 0xdf0) (R/W 32) Debug Halting Control and Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t C_DEBUGEN:1;               /**< bit:      0  Halting Debug Enabled (Must write 0xA05F to bits 31:16 to access) */
    uint32_t C_HALT:1;                  /**< bit:      1  Request a running processor to halt (Must write 0xA05F to bits 31:16 to access) */
    uint32_t C_STEP:1;                  /**< bit:      2  Single-Stepping Enabled (Must write 0xA05F to bits 31:16 to access) */
    uint32_t C_MASKINTS:1;              /**< bit:      3  Mask PendSV, SysTick and external configurable interrupts (Must write 0xA05F to bits 31:16 to access) */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t S_REGRDY:1;                /**< bit:     16  Transfer to or from the DCRDR is complete */
    uint32_t S_HALT:1;                  /**< bit:     17  In Debug State                           */
    uint32_t S_SLEEP:1;                 /**< bit:     18  Sleeping                                 */
    uint32_t S_LOCKUP:1;                /**< bit:     19  Locked Up                                */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t S_RETIRE_ST:1;             /**< bit:     24  At least one instruction has completed since last DHCSR read */
    uint32_t S_RESET_ST:1;              /**< bit:     25  At least one reset since last DHCSR read */
    uint32_t :6;                        /**< bit: 26..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_DHCSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_DHCSR_OFFSET            0xDF0                                         /**<  (ARM_SYSCTRL_DHCSR) Debug Halting Control and Status Register  Offset */
#define ARM_SYSCTRL_DHCSR_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_DHCSR) Debug Halting Control and Status Register  Reset Value */

#define ARM_SYSCTRL_DHCSR_C_DEBUGEN_Pos     0                                              /**< (ARM_SYSCTRL_DHCSR) Halting Debug Enabled (Must write 0xA05F to bits 31:16 to access) Position */
#define ARM_SYSCTRL_DHCSR_C_DEBUGEN_Msk     (0x1u << ARM_SYSCTRL_DHCSR_C_DEBUGEN_Pos)      /**< (ARM_SYSCTRL_DHCSR) Halting Debug Enabled (Must write 0xA05F to bits 31:16 to access) Mask */
#define ARM_SYSCTRL_DHCSR_C_DEBUGEN         ARM_SYSCTRL_DHCSR_C_DEBUGEN_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_C_DEBUGEN_Msk instead */
#define ARM_SYSCTRL_DHCSR_C_HALT_Pos        1                                              /**< (ARM_SYSCTRL_DHCSR) Request a running processor to halt (Must write 0xA05F to bits 31:16 to access) Position */
#define ARM_SYSCTRL_DHCSR_C_HALT_Msk        (0x1u << ARM_SYSCTRL_DHCSR_C_HALT_Pos)         /**< (ARM_SYSCTRL_DHCSR) Request a running processor to halt (Must write 0xA05F to bits 31:16 to access) Mask */
#define ARM_SYSCTRL_DHCSR_C_HALT            ARM_SYSCTRL_DHCSR_C_HALT_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_C_HALT_Msk instead */
#define ARM_SYSCTRL_DHCSR_C_STEP_Pos        2                                              /**< (ARM_SYSCTRL_DHCSR) Single-Stepping Enabled (Must write 0xA05F to bits 31:16 to access) Position */
#define ARM_SYSCTRL_DHCSR_C_STEP_Msk        (0x1u << ARM_SYSCTRL_DHCSR_C_STEP_Pos)         /**< (ARM_SYSCTRL_DHCSR) Single-Stepping Enabled (Must write 0xA05F to bits 31:16 to access) Mask */
#define ARM_SYSCTRL_DHCSR_C_STEP            ARM_SYSCTRL_DHCSR_C_STEP_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_C_STEP_Msk instead */
#define ARM_SYSCTRL_DHCSR_C_MASKINTS_Pos    3                                              /**< (ARM_SYSCTRL_DHCSR) Mask PendSV, SysTick and external configurable interrupts (Must write 0xA05F to bits 31:16 to access) Position */
#define ARM_SYSCTRL_DHCSR_C_MASKINTS_Msk    (0x1u << ARM_SYSCTRL_DHCSR_C_MASKINTS_Pos)     /**< (ARM_SYSCTRL_DHCSR) Mask PendSV, SysTick and external configurable interrupts (Must write 0xA05F to bits 31:16 to access) Mask */
#define ARM_SYSCTRL_DHCSR_C_MASKINTS        ARM_SYSCTRL_DHCSR_C_MASKINTS_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_C_MASKINTS_Msk instead */
#define ARM_SYSCTRL_DHCSR_S_REGRDY_Pos      16                                             /**< (ARM_SYSCTRL_DHCSR) Transfer to or from the DCRDR is complete Position */
#define ARM_SYSCTRL_DHCSR_S_REGRDY_Msk      (0x1u << ARM_SYSCTRL_DHCSR_S_REGRDY_Pos)       /**< (ARM_SYSCTRL_DHCSR) Transfer to or from the DCRDR is complete Mask */
#define ARM_SYSCTRL_DHCSR_S_REGRDY          ARM_SYSCTRL_DHCSR_S_REGRDY_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_S_REGRDY_Msk instead */
#define ARM_SYSCTRL_DHCSR_S_HALT_Pos        17                                             /**< (ARM_SYSCTRL_DHCSR) In Debug State Position */
#define ARM_SYSCTRL_DHCSR_S_HALT_Msk        (0x1u << ARM_SYSCTRL_DHCSR_S_HALT_Pos)         /**< (ARM_SYSCTRL_DHCSR) In Debug State Mask */
#define ARM_SYSCTRL_DHCSR_S_HALT            ARM_SYSCTRL_DHCSR_S_HALT_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_S_HALT_Msk instead */
#define ARM_SYSCTRL_DHCSR_S_SLEEP_Pos       18                                             /**< (ARM_SYSCTRL_DHCSR) Sleeping Position */
#define ARM_SYSCTRL_DHCSR_S_SLEEP_Msk       (0x1u << ARM_SYSCTRL_DHCSR_S_SLEEP_Pos)        /**< (ARM_SYSCTRL_DHCSR) Sleeping Mask */
#define ARM_SYSCTRL_DHCSR_S_SLEEP           ARM_SYSCTRL_DHCSR_S_SLEEP_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_S_SLEEP_Msk instead */
#define ARM_SYSCTRL_DHCSR_S_LOCKUP_Pos      19                                             /**< (ARM_SYSCTRL_DHCSR) Locked Up Position */
#define ARM_SYSCTRL_DHCSR_S_LOCKUP_Msk      (0x1u << ARM_SYSCTRL_DHCSR_S_LOCKUP_Pos)       /**< (ARM_SYSCTRL_DHCSR) Locked Up Mask */
#define ARM_SYSCTRL_DHCSR_S_LOCKUP          ARM_SYSCTRL_DHCSR_S_LOCKUP_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_S_LOCKUP_Msk instead */
#define ARM_SYSCTRL_DHCSR_S_RETIRE_ST_Pos   24                                             /**< (ARM_SYSCTRL_DHCSR) At least one instruction has completed since last DHCSR read Position */
#define ARM_SYSCTRL_DHCSR_S_RETIRE_ST_Msk   (0x1u << ARM_SYSCTRL_DHCSR_S_RETIRE_ST_Pos)    /**< (ARM_SYSCTRL_DHCSR) At least one instruction has completed since last DHCSR read Mask */
#define ARM_SYSCTRL_DHCSR_S_RETIRE_ST       ARM_SYSCTRL_DHCSR_S_RETIRE_ST_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_S_RETIRE_ST_Msk instead */
#define ARM_SYSCTRL_DHCSR_S_RESET_ST_Pos    25                                             /**< (ARM_SYSCTRL_DHCSR) At least one reset since last DHCSR read Position */
#define ARM_SYSCTRL_DHCSR_S_RESET_ST_Msk    (0x1u << ARM_SYSCTRL_DHCSR_S_RESET_ST_Pos)     /**< (ARM_SYSCTRL_DHCSR) At least one reset since last DHCSR read Mask */
#define ARM_SYSCTRL_DHCSR_S_RESET_ST        ARM_SYSCTRL_DHCSR_S_RESET_ST_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DHCSR_S_RESET_ST_Msk instead */
#define ARM_SYSCTRL_DHCSR_Msk               0x30F000Fu                                     /**< (ARM_SYSCTRL_DHCSR) Register Mask  */

/* -------- ARM_SYSCTRL_DCRSR : (ARM_SYSCTRL Offset: 0xdf4) (R/W 32) Debug Core Register Selector Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t REGSEL:5;                  /**< bit:   0..4  Specifies the ARM core register or special purpose register to transfer */
    uint32_t :11;                       /**< bit:  5..15  Reserved */
    uint32_t REGWNR:1;                  /**< bit:     16  If 1 then transfer is a write            */
    uint32_t :15;                       /**< bit: 17..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_DCRSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

