remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#define ARM_SYSCTRL_DCRSR_OFFSET            0xDF4                                         /**<  (ARM_SYSCTRL_DCRSR) Debug Core Register Selector Register  Offset */
#define ARM_SYSCTRL_DCRSR_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_DCRSR) Debug Core Register Selector Register  Reset Value */

#define ARM_SYSCTRL_DCRSR_REGSEL_Pos        0                                              /**< (ARM_SYSCTRL_DCRSR) Specifies the ARM core register or special purpose register to transfer Position */
#define ARM_SYSCTRL_DCRSR_REGSEL_Msk        (0x1Fu << ARM_SYSCTRL_DCRSR_REGSEL_Pos)        /**< (ARM_SYSCTRL_DCRSR) Specifies the ARM core register or special purpose register to transfer Mask */
#define ARM_SYSCTRL_DCRSR_REGSEL(value)     (ARM_SYSCTRL_DCRSR_REGSEL_Msk & ((value) << ARM_SYSCTRL_DCRSR_REGSEL_Pos))
#define   ARM_SYSCTRL_DCRSR_REGSEL_0_Val    0x0u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R0  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_1_Val    0x1u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R1  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_2_Val    0x2u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R2  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_3_Val    0x3u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R3  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_4_Val    0x4u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R4  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_5_Val    0x5u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R5  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_6_Val    0x6u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R6  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_7_Val    0x7u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R7  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_8_Val    0x8u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R8  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_9_Val    0x9u                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R9  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_10_Val   0xAu                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R10  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_11_Val   0xBu                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R11  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_12_Val   0xCu                                           /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R12  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_13_Val   0xDu                                           /**< (ARM_SYSCTRL_DCRSR) Current SP  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_14_Val   0xEu                                           /**< (ARM_SYSCTRL_DCRSR) LR  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_15_Val   0xFu                                           /**< (ARM_SYSCTRL_DCRSR) DebugReturnAddress  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_16_Val   0x10u                                          /**< (ARM_SYSCTRL_DCRSR) xPSR  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_17_Val   0x11u                                          /**< (ARM_SYSCTRL_DCRSR) MSP  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_18_Val   0x12u                                          /**< (ARM_SYSCTRL_DCRSR) PSP  */
#define   ARM_SYSCTRL_DCRSR_REGSEL_20_Val   0x14u                                          /**< (ARM_SYSCTRL_DCRSR) CONTROL and PRIMASK  */
#define ARM_SYSCTRL_DCRSR_REGSEL_0          (ARM_SYSCTRL_DCRSR_REGSEL_0_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R0 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_1          (ARM_SYSCTRL_DCRSR_REGSEL_1_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R1 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_2          (ARM_SYSCTRL_DCRSR_REGSEL_2_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R2 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_3          (ARM_SYSCTRL_DCRSR_REGSEL_3_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R3 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_4          (ARM_SYSCTRL_DCRSR_REGSEL_4_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R4 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_5          (ARM_SYSCTRL_DCRSR_REGSEL_5_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R5 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_6          (ARM_SYSCTRL_DCRSR_REGSEL_6_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R6 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_7          (ARM_SYSCTRL_DCRSR_REGSEL_7_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R7 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_8          (ARM_SYSCTRL_DCRSR_REGSEL_8_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R8 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_9          (ARM_SYSCTRL_DCRSR_REGSEL_9_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R9 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_10         (ARM_SYSCTRL_DCRSR_REGSEL_10_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R10 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_11         (ARM_SYSCTRL_DCRSR_REGSEL_11_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R11 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_12         (ARM_SYSCTRL_DCRSR_REGSEL_12_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) ARM Core Register R12 Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_13         (ARM_SYSCTRL_DCRSR_REGSEL_13_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) Current SP Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_14         (ARM_SYSCTRL_DCRSR_REGSEL_14_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) LR Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_15         (ARM_SYSCTRL_DCRSR_REGSEL_15_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) DebugReturnAddress Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_16         (ARM_SYSCTRL_DCRSR_REGSEL_16_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) xPSR Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_17         (ARM_SYSCTRL_DCRSR_REGSEL_17_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) MSP Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_18         (ARM_SYSCTRL_DCRSR_REGSEL_18_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) PSP Position  */
#define ARM_SYSCTRL_DCRSR_REGSEL_20         (ARM_SYSCTRL_DCRSR_REGSEL_20_Val << ARM_SYSCTRL_DCRSR_REGSEL_Pos)  /**< (ARM_SYSCTRL_DCRSR) CONTROL and PRIMASK Position  */
#define ARM_SYSCTRL_DCRSR_REGWNR_Pos        16                                             /**< (ARM_SYSCTRL_DCRSR) If 1 then transfer is a write Position */
#define ARM_SYSCTRL_DCRSR_REGWNR_Msk        (0x1u << ARM_SYSCTRL_DCRSR_REGWNR_Pos)         /**< (ARM_SYSCTRL_DCRSR) If 1 then transfer is a write Mask */
#define ARM_SYSCTRL_DCRSR_REGWNR            ARM_SYSCTRL_DCRSR_REGWNR_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DCRSR_REGWNR_Msk instead */
#define ARM_SYSCTRL_DCRSR_MASK              0x1001Fu                                       /**< \deprecated (ARM_SYSCTRL_DCRSR) Register MASK  (Use ARM_SYSCTRL_DCRSR_Msk instead)  */
#define ARM_SYSCTRL_DCRSR_Msk               0x1001Fu                                       /**< (ARM_SYSCTRL_DCRSR) Register Mask  */

