remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
/* -------- ARM_SYSCTRL_DCRDR : (ARM_SYSCTRL Offset: 0xdf8) (R/W 32) Debug Core Register Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DBGTMP:32;                 /**< bit:  0..31  Data Temporary Cache                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_DCRDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_DCRDR_OFFSET            0xDF8                                         /**<  (ARM_SYSCTRL_DCRDR) Debug Core Register Data Register  Offset */
#define ARM_SYSCTRL_DCRDR_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_DCRDR) Debug Core Register Data Register  Reset Value */

#define ARM_SYSCTRL_DCRDR_DBGTMP_Pos        0                                              /**< (ARM_SYSCTRL_DCRDR) Data Temporary Cache Position */
#define ARM_SYSCTRL_DCRDR_DBGTMP_Msk        (0xFFFFFFFFu << ARM_SYSCTRL_DCRDR_DBGTMP_Pos)  /**< (ARM_SYSCTRL_DCRDR) Data Temporary Cache Mask */
#define ARM_SYSCTRL_DCRDR_DBGTMP(value)     (ARM_SYSCTRL_DCRDR_DBGTMP_Msk & ((value) << ARM_SYSCTRL_DCRDR_DBGTMP_Pos))
#define ARM_SYSCTRL_DCRDR_MASK              0xFFFFFFFFu                                    /**< \deprecated (ARM_SYSCTRL_DCRDR) Register MASK  (Use ARM_SYSCTRL_DCRDR_Msk instead)  */
#define ARM_SYSCTRL_DCRDR_Msk               0xFFFFFFFFu                                    /**< (ARM_SYSCTRL_DCRDR) Register Mask  */

/* -------- ARM_SYSCTRL_DEMCR : (ARM_SYSCTRL Offset: 0xdfc) (R/W 32) Debug Exception and Monitor Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t VC_CORERESET:1;            /**< bit:      0  Reset Vector Catch Enabled               */
    uint32_t :9;                        /**< bit:   1..9  Reserved */
    uint32_t VC_HARDERR:1;              /**< bit:     10  Halting Debug Trap Enabled               */
    uint32_t :13;                       /**< bit: 11..23  Reserved */
    uint32_t DWTENA:1;                  /**< bit:     24  DWT Enabled                              */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ARM_SYSCTRL_DEMCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_DEMCR_OFFSET            0xDFC                                         /**<  (ARM_SYSCTRL_DEMCR) Debug Exception and Monitor Control Register  Offset */
#define ARM_SYSCTRL_DEMCR_RESETVALUE        0x00u                                         /**<  (ARM_SYSCTRL_DEMCR) Debug Exception and Monitor Control Register  Reset Value */

#define ARM_SYSCTRL_DEMCR_VC_CORERESET_Pos  0                                              /**< (ARM_SYSCTRL_DEMCR) Reset Vector Catch Enabled Position */
#define ARM_SYSCTRL_DEMCR_VC_CORERESET_Msk  (0x1u << ARM_SYSCTRL_DEMCR_VC_CORERESET_Pos)   /**< (ARM_SYSCTRL_DEMCR) Reset Vector Catch Enabled Mask */
#define ARM_SYSCTRL_DEMCR_VC_CORERESET      ARM_SYSCTRL_DEMCR_VC_CORERESET_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DEMCR_VC_CORERESET_Msk instead */
#define ARM_SYSCTRL_DEMCR_VC_HARDERR_Pos    10                                             /**< (ARM_SYSCTRL_DEMCR) Halting Debug Trap Enabled Position */
#define ARM_SYSCTRL_DEMCR_VC_HARDERR_Msk    (0x1u << ARM_SYSCTRL_DEMCR_VC_HARDERR_Pos)     /**< (ARM_SYSCTRL_DEMCR) Halting Debug Trap Enabled Mask */
#define ARM_SYSCTRL_DEMCR_VC_HARDERR        ARM_SYSCTRL_DEMCR_VC_HARDERR_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DEMCR_VC_HARDERR_Msk instead */
#define ARM_SYSCTRL_DEMCR_DWTENA_Pos        24                                             /**< (ARM_SYSCTRL_DEMCR) DWT Enabled Position */
#define ARM_SYSCTRL_DEMCR_DWTENA_Msk        (0x1u << ARM_SYSCTRL_DEMCR_DWTENA_Pos)         /**< (ARM_SYSCTRL_DEMCR) DWT Enabled Mask */
#define ARM_SYSCTRL_DEMCR_DWTENA            ARM_SYSCTRL_DEMCR_DWTENA_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_DEMCR_DWTENA_Msk instead */
#define ARM_SYSCTRL_DEMCR_MASK              0x1000401u                                     /**< \deprecated (ARM_SYSCTRL_DEMCR) Register MASK  (Use ARM_SYSCTRL_DEMCR_Msk instead)  */
#define ARM_SYSCTRL_DEMCR_Msk               0x1000401u                                     /**< (ARM_SYSCTRL_DEMCR) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_PID4 : (ARM_SYSCTRL Offset: 0xfd0) (R/ 8) Peripheral ID Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_C_CODE:4;           /**< bit:   0..3  JEP106 C Code                            */
    uint8_t  BLOCK_COUNT:4;             /**< bit:   4..7  Block Count                              */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_PID4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCS_PID4_OFFSET         0xFD0                                         /**<  (ARM_SYSCTRL_SCS_PID4) Peripheral ID Register 4  Offset */
#define ARM_SYSCTRL_SCS_PID4_RESETVALUE     0x04u                                         /**<  (ARM_SYSCTRL_SCS_PID4) Peripheral ID Register 4  Reset Value */

#define ARM_SYSCTRL_SCS_PID4_JEP106_C_CODE_Pos 0                                              /**< (ARM_SYSCTRL_SCS_PID4) JEP106 C Code Position */
#define ARM_SYSCTRL_SCS_PID4_JEP106_C_CODE_Msk (0xFu << ARM_SYSCTRL_SCS_PID4_JEP106_C_CODE_Pos)  /**< (ARM_SYSCTRL_SCS_PID4) JEP106 C Code Mask */
#define ARM_SYSCTRL_SCS_PID4_JEP106_C_CODE(value) (ARM_SYSCTRL_SCS_PID4_JEP106_C_CODE_Msk & ((value) << ARM_SYSCTRL_SCS_PID4_JEP106_C_CODE_Pos))
#define ARM_SYSCTRL_SCS_PID4_BLOCK_COUNT_Pos 4                                              /**< (ARM_SYSCTRL_SCS_PID4) Block Count Position */
#define ARM_SYSCTRL_SCS_PID4_BLOCK_COUNT_Msk (0xFu << ARM_SYSCTRL_SCS_PID4_BLOCK_COUNT_Pos)  /**< (ARM_SYSCTRL_SCS_PID4) Block Count Mask */
#define ARM_SYSCTRL_SCS_PID4_BLOCK_COUNT(value) (ARM_SYSCTRL_SCS_PID4_BLOCK_COUNT_Msk & ((value) << ARM_SYSCTRL_SCS_PID4_BLOCK_COUNT_Pos))
#define ARM_SYSCTRL_SCS_PID4_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_PID4) Register MASK  (Use ARM_SYSCTRL_SCS_PID4_Msk instead)  */
#define ARM_SYSCTRL_SCS_PID4_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_PID4) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_PID0 : (ARM_SYSCTRL Offset: 0xfe0) (R/ 8) Peripheral ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:8;             /**< bit:   0..7  Part Number Bits 7:0                     */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_PID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCS_PID0_OFFSET         0xFE0                                         /**<  (ARM_SYSCTRL_SCS_PID0) Peripheral ID Register 0  Offset */
#define ARM_SYSCTRL_SCS_PID0_RESETVALUE     0x08u                                         /**<  (ARM_SYSCTRL_SCS_PID0) Peripheral ID Register 0  Reset Value */

#define ARM_SYSCTRL_SCS_PID0_PART_NUMBER_Pos 0                                              /**< (ARM_SYSCTRL_SCS_PID0) Part Number Bits 7:0 Position */
#define ARM_SYSCTRL_SCS_PID0_PART_NUMBER_Msk (0xFFu << ARM_SYSCTRL_SCS_PID0_PART_NUMBER_Pos)  /**< (ARM_SYSCTRL_SCS_PID0) Part Number Bits 7:0 Mask */
#define ARM_SYSCTRL_SCS_PID0_PART_NUMBER(value) (ARM_SYSCTRL_SCS_PID0_PART_NUMBER_Msk & ((value) << ARM_SYSCTRL_SCS_PID0_PART_NUMBER_Pos))
#define ARM_SYSCTRL_SCS_PID0_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_PID0) Register MASK  (Use ARM_SYSCTRL_SCS_PID0_Msk instead)  */
#define ARM_SYSCTRL_SCS_PID0_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_PID0) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_PID1 : (ARM_SYSCTRL Offset: 0xfe4) (R/ 8) Peripheral ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:4;             /**< bit:   0..3  Part Number Bits 11:8                    */
    uint8_t  JEP106_ID_3_0:4;           /**< bit:   4..7  JEP106 ID Code Bits 3:0                  */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_PID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCS_PID1_OFFSET         0xFE4                                         /**<  (ARM_SYSCTRL_SCS_PID1) Peripheral ID Register 1  Offset */
#define ARM_SYSCTRL_SCS_PID1_RESETVALUE     0xB0u                                         /**<  (ARM_SYSCTRL_SCS_PID1) Peripheral ID Register 1  Reset Value */

#define ARM_SYSCTRL_SCS_PID1_PART_NUMBER_Pos 0                                              /**< (ARM_SYSCTRL_SCS_PID1) Part Number Bits 11:8 Position */
#define ARM_SYSCTRL_SCS_PID1_PART_NUMBER_Msk (0xFu << ARM_SYSCTRL_SCS_PID1_PART_NUMBER_Pos)  /**< (ARM_SYSCTRL_SCS_PID1) Part Number Bits 11:8 Mask */
#define ARM_SYSCTRL_SCS_PID1_PART_NUMBER(value) (ARM_SYSCTRL_SCS_PID1_PART_NUMBER_Msk & ((value) << ARM_SYSCTRL_SCS_PID1_PART_NUMBER_Pos))
#define ARM_SYSCTRL_SCS_PID1_JEP106_ID_3_0_Pos 4                                              /**< (ARM_SYSCTRL_SCS_PID1) JEP106 ID Code Bits 3:0 Position */
#define ARM_SYSCTRL_SCS_PID1_JEP106_ID_3_0_Msk (0xFu << ARM_SYSCTRL_SCS_PID1_JEP106_ID_3_0_Pos)  /**< (ARM_SYSCTRL_SCS_PID1) JEP106 ID Code Bits 3:0 Mask */
#define ARM_SYSCTRL_SCS_PID1_JEP106_ID_3_0(value) (ARM_SYSCTRL_SCS_PID1_JEP106_ID_3_0_Msk & ((value) << ARM_SYSCTRL_SCS_PID1_JEP106_ID_3_0_Pos))
#define ARM_SYSCTRL_SCS_PID1_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_PID1) Register MASK  (Use ARM_SYSCTRL_SCS_PID1_Msk instead)  */
#define ARM_SYSCTRL_SCS_PID1_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_PID1) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_PID2 : (ARM_SYSCTRL Offset: 0xfe8) (R/ 8) Peripheral ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_ID_6_4:3;           /**< bit:   0..2  JEP106 ID Code Bits 6:4                  */
    uint8_t  JEDEC_USED:1;              /**< bit:      3  JEDEC Used                               */
    uint8_t  REVISION:4;                /**< bit:   4..7  Revision                                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_PID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

