remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#define ARM_SYSCTRL_SCS_PID2_OFFSET         0xFE8                                         /**<  (ARM_SYSCTRL_SCS_PID2) Peripheral ID Register 2  Offset */
#define ARM_SYSCTRL_SCS_PID2_RESETVALUE     0x0Bu                                         /**<  (ARM_SYSCTRL_SCS_PID2) Peripheral ID Register 2  Reset Value */

#define ARM_SYSCTRL_SCS_PID2_JEP106_ID_6_4_Pos 0                                              /**< (ARM_SYSCTRL_SCS_PID2) JEP106 ID Code Bits 6:4 Position */
#define ARM_SYSCTRL_SCS_PID2_JEP106_ID_6_4_Msk (0x7u << ARM_SYSCTRL_SCS_PID2_JEP106_ID_6_4_Pos)  /**< (ARM_SYSCTRL_SCS_PID2) JEP106 ID Code Bits 6:4 Mask */
#define ARM_SYSCTRL_SCS_PID2_JEP106_ID_6_4(value) (ARM_SYSCTRL_SCS_PID2_JEP106_ID_6_4_Msk & ((value) << ARM_SYSCTRL_SCS_PID2_JEP106_ID_6_4_Pos))
#define ARM_SYSCTRL_SCS_PID2_JEDEC_USED_Pos 3                                              /**< (ARM_SYSCTRL_SCS_PID2) JEDEC Used Position */
#define ARM_SYSCTRL_SCS_PID2_JEDEC_USED_Msk (0x1u << ARM_SYSCTRL_SCS_PID2_JEDEC_USED_Pos)  /**< (ARM_SYSCTRL_SCS_PID2) JEDEC Used Mask */
#define ARM_SYSCTRL_SCS_PID2_JEDEC_USED     ARM_SYSCTRL_SCS_PID2_JEDEC_USED_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ARM_SYSCTRL_SCS_PID2_JEDEC_USED_Msk instead */
#define ARM_SYSCTRL_SCS_PID2_REVISION_Pos   4                                              /**< (ARM_SYSCTRL_SCS_PID2) Revision Position */
#define ARM_SYSCTRL_SCS_PID2_REVISION_Msk   (0xFu << ARM_SYSCTRL_SCS_PID2_REVISION_Pos)    /**< (ARM_SYSCTRL_SCS_PID2) Revision Mask */
#define ARM_SYSCTRL_SCS_PID2_REVISION(value) (ARM_SYSCTRL_SCS_PID2_REVISION_Msk & ((value) << ARM_SYSCTRL_SCS_PID2_REVISION_Pos))
#define ARM_SYSCTRL_SCS_PID2_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_PID2) Register MASK  (Use ARM_SYSCTRL_SCS_PID2_Msk instead)  */
#define ARM_SYSCTRL_SCS_PID2_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_PID2) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_PID3 : (ARM_SYSCTRL Offset: 0xfec) (R/ 8) Peripheral ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CUSTOMER_MOD_NUMBER:4;     /**< bit:   0..3  Customer Modification Number             */
    uint8_t  ECO_REV_NUMBER:4;          /**< bit:   4..7  ECO Revision Number                      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_PID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCS_PID3_OFFSET         0xFEC                                         /**<  (ARM_SYSCTRL_SCS_PID3) Peripheral ID Register 3  Offset */
#define ARM_SYSCTRL_SCS_PID3_RESETVALUE     0x00u                                         /**<  (ARM_SYSCTRL_SCS_PID3) Peripheral ID Register 3  Reset Value */

#define ARM_SYSCTRL_SCS_PID3_CUSTOMER_MOD_NUMBER_Pos 0                                              /**< (ARM_SYSCTRL_SCS_PID3) Customer Modification Number Position */
#define ARM_SYSCTRL_SCS_PID3_CUSTOMER_MOD_NUMBER_Msk (0xFu << ARM_SYSCTRL_SCS_PID3_CUSTOMER_MOD_NUMBER_Pos)  /**< (ARM_SYSCTRL_SCS_PID3) Customer Modification Number Mask */
#define ARM_SYSCTRL_SCS_PID3_CUSTOMER_MOD_NUMBER(value) (ARM_SYSCTRL_SCS_PID3_CUSTOMER_MOD_NUMBER_Msk & ((value) << ARM_SYSCTRL_SCS_PID3_CUSTOMER_MOD_NUMBER_Pos))
#define ARM_SYSCTRL_SCS_PID3_ECO_REV_NUMBER_Pos 4                                              /**< (ARM_SYSCTRL_SCS_PID3) ECO Revision Number Position */
#define ARM_SYSCTRL_SCS_PID3_ECO_REV_NUMBER_Msk (0xFu << ARM_SYSCTRL_SCS_PID3_ECO_REV_NUMBER_Pos)  /**< (ARM_SYSCTRL_SCS_PID3) ECO Revision Number Mask */
#define ARM_SYSCTRL_SCS_PID3_ECO_REV_NUMBER(value) (ARM_SYSCTRL_SCS_PID3_ECO_REV_NUMBER_Msk & ((value) << ARM_SYSCTRL_SCS_PID3_ECO_REV_NUMBER_Pos))
#define ARM_SYSCTRL_SCS_PID3_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_PID3) Register MASK  (Use ARM_SYSCTRL_SCS_PID3_Msk instead)  */
#define ARM_SYSCTRL_SCS_PID3_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_PID3) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_CID0 : (ARM_SYSCTRL Offset: 0xff0) (R/ 8) Component ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  SCS_CID0:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_CID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCS_CID0_OFFSET         0xFF0                                         /**<  (ARM_SYSCTRL_SCS_CID0) Component ID Register 0  Offset */
#define ARM_SYSCTRL_SCS_CID0_RESETVALUE     0x0Du                                         /**<  (ARM_SYSCTRL_SCS_CID0) Component ID Register 0  Reset Value */

#define ARM_SYSCTRL_SCS_CID0_SCS_CID0_Pos   0                                              /**< (ARM_SYSCTRL_SCS_CID0)  Position */
#define ARM_SYSCTRL_SCS_CID0_SCS_CID0_Msk   (0xFFu << ARM_SYSCTRL_SCS_CID0_SCS_CID0_Pos)   /**< (ARM_SYSCTRL_SCS_CID0)  Mask */
#define ARM_SYSCTRL_SCS_CID0_SCS_CID0(value) (ARM_SYSCTRL_SCS_CID0_SCS_CID0_Msk & ((value) << ARM_SYSCTRL_SCS_CID0_SCS_CID0_Pos))
#define ARM_SYSCTRL_SCS_CID0_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_CID0) Register MASK  (Use ARM_SYSCTRL_SCS_CID0_Msk instead)  */
#define ARM_SYSCTRL_SCS_CID0_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_CID0) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_CID1 : (ARM_SYSCTRL Offset: 0xff4) (R/ 8) Component ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  SCS_CID1:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_CID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCS_CID1_OFFSET         0xFF4                                         /**<  (ARM_SYSCTRL_SCS_CID1) Component ID Register 1  Offset */
#define ARM_SYSCTRL_SCS_CID1_RESETVALUE     0xE0u                                         /**<  (ARM_SYSCTRL_SCS_CID1) Component ID Register 1  Reset Value */

