remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#define ARM_SYSCTRL_SCS_CID1_SCS_CID1_Pos   0                                              /**< (ARM_SYSCTRL_SCS_CID1)  Position */
#define ARM_SYSCTRL_SCS_CID1_SCS_CID1_Msk   (0xFFu << ARM_SYSCTRL_SCS_CID1_SCS_CID1_Pos)   /**< (ARM_SYSCTRL_SCS_CID1)  Mask */
#define ARM_SYSCTRL_SCS_CID1_SCS_CID1(value) (ARM_SYSCTRL_SCS_CID1_SCS_CID1_Msk & ((value) << ARM_SYSCTRL_SCS_CID1_SCS_CID1_Pos))
#define ARM_SYSCTRL_SCS_CID1_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_CID1) Register MASK  (Use ARM_SYSCTRL_SCS_CID1_Msk instead)  */
#define ARM_SYSCTRL_SCS_CID1_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_CID1) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_CID2 : (ARM_SYSCTRL Offset: 0xff8) (R/ 8) Component ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  SCS_CID2:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_CID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCS_CID2_OFFSET         0xFF8                                         /**<  (ARM_SYSCTRL_SCS_CID2) Component ID Register 2  Offset */
#define ARM_SYSCTRL_SCS_CID2_RESETVALUE     0x05u                                         /**<  (ARM_SYSCTRL_SCS_CID2) Component ID Register 2  Reset Value */

#define ARM_SYSCTRL_SCS_CID2_SCS_CID2_Pos   0                                              /**< (ARM_SYSCTRL_SCS_CID2)  Position */
#define ARM_SYSCTRL_SCS_CID2_SCS_CID2_Msk   (0xFFu << ARM_SYSCTRL_SCS_CID2_SCS_CID2_Pos)   /**< (ARM_SYSCTRL_SCS_CID2)  Mask */
#define ARM_SYSCTRL_SCS_CID2_SCS_CID2(value) (ARM_SYSCTRL_SCS_CID2_SCS_CID2_Msk & ((value) << ARM_SYSCTRL_SCS_CID2_SCS_CID2_Pos))
#define ARM_SYSCTRL_SCS_CID2_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_CID2) Register MASK  (Use ARM_SYSCTRL_SCS_CID2_Msk instead)  */
#define ARM_SYSCTRL_SCS_CID2_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_CID2) Register Mask  */

/* -------- ARM_SYSCTRL_SCS_CID3 : (ARM_SYSCTRL Offset: 0xffc) (R/ 8) Component ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  SCS_CID3:8;                /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} ARM_SYSCTRL_SCS_CID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ARM_SYSCTRL_SCS_CID3_OFFSET         0xFFC                                         /**<  (ARM_SYSCTRL_SCS_CID3) Component ID Register 3  Offset */
#define ARM_SYSCTRL_SCS_CID3_RESETVALUE     0xB1u                                         /**<  (ARM_SYSCTRL_SCS_CID3) Component ID Register 3  Reset Value */

#define ARM_SYSCTRL_SCS_CID3_SCS_CID3_Pos   0                                              /**< (ARM_SYSCTRL_SCS_CID3)  Position */
#define ARM_SYSCTRL_SCS_CID3_SCS_CID3_Msk   (0xFFu << ARM_SYSCTRL_SCS_CID3_SCS_CID3_Pos)   /**< (ARM_SYSCTRL_SCS_CID3)  Mask */
#define ARM_SYSCTRL_SCS_CID3_SCS_CID3(value) (ARM_SYSCTRL_SCS_CID3_SCS_CID3_Msk & ((value) << ARM_SYSCTRL_SCS_CID3_SCS_CID3_Pos))
#define ARM_SYSCTRL_SCS_CID3_MASK           0xFFu                                          /**< \deprecated (ARM_SYSCTRL_SCS_CID3) Register MASK  (Use ARM_SYSCTRL_SCS_CID3_Msk instead)  */
#define ARM_SYSCTRL_SCS_CID3_Msk            0xFFu                                          /**< (ARM_SYSCTRL_SCS_CID3) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief ARM_SYSCTRL hardware registers */
typedef struct {  /* ARM System Control */
  __I  uint32_t Reserved1[2];
  RoReg   ACTLR;          /**< (ARM_SYSCTRL Offset: 0x08) Auxiliary Control Register (not implemented) */
  __I  uint32_t Reserved2[1];
  RwReg   SYST_CSR;       /**< (ARM_SYSCTRL Offset: 0x10) SysTick Control and Status Register */
  RwReg   SYST_RVR;       /**< (ARM_SYSCTRL Offset: 0x14) SysTick Reload Value Register */
  RwReg   SYST_CVR;       /**< (ARM_SYSCTRL Offset: 0x18) SysTick Current Value Register (Any Write Clears to 0) */
  RoReg   SYST_CALIB;     /**< (ARM_SYSCTRL Offset: 0x1C) SysTick Calibration Value Register */
  __I  uint32_t Reserved3[56];
  RwReg   NVIC_ISER;      /**< (ARM_SYSCTRL Offset: 0x100) Interrupt Set-Enable Register */
  __I  uint32_t Reserved4[31];
  RwReg   NVIC_ICER;      /**< (ARM_SYSCTRL Offset: 0x180) Interrupt Clear Enable Register */
  __I  uint32_t Reserved5[31];
  RwReg   NVIC_ISPR;      /**< (ARM_SYSCTRL Offset: 0x200) Interrupt Set-Pending Register */
  __I  uint32_t Reserved6[31];
  RwReg   NVIC_ICPR;      /**< (ARM_SYSCTRL Offset: 0x280) Interrupt Clear-Pending Register */
  __I  uint32_t Reserved7[95];
  RwReg   NVIC_IPR0;      /**< (ARM_SYSCTRL Offset: 0x400) Interrupt Priority Register 0 */
  RwReg   NVIC_IPR1;      /**< (ARM_SYSCTRL Offset: 0x404) Interrupt Priority Register 1 */
  RwReg   NVIC_IPR2;      /**< (ARM_SYSCTRL Offset: 0x408) Interrupt Priority Register 2 */
  RwReg   NVIC_IPR3;      /**< (ARM_SYSCTRL Offset: 0x40C) Interrupt Priority Register 3 */
  RwReg   NVIC_IPR4;      /**< (ARM_SYSCTRL Offset: 0x410) Interrupt Priority Register 4 */
  RwReg   NVIC_IPR5;      /**< (ARM_SYSCTRL Offset: 0x414) Interrupt Priority Register 5 */
  RwReg   NVIC_IPR6;      /**< (ARM_SYSCTRL Offset: 0x418) Interrupt Priority Register 6 */
  RwReg   NVIC_IPR7;      /**< (ARM_SYSCTRL Offset: 0x41C) Interrupt Priority Register 7 */
  __I  uint32_t Reserved8[568];
  RoReg   CPUID;          /**< (ARM_SYSCTRL Offset: 0xD00) CPU Identification Register */
  RoReg   ICSR;           /**< (ARM_SYSCTRL Offset: 0xD04) Interrupt Control State Register */
  __I  uint32_t Reserved9[1];
  RoReg   AIRCR;          /**< (ARM_SYSCTRL Offset: 0xD0C) Application Interrupt and Reset Control Register */
  RwReg8  SCR;            /**< (ARM_SYSCTRL Offset: 0xD10) System Control Register */
  __I  uint8_t  Reserved10[3];
  RoReg16 CCR;            /**< (ARM_SYSCTRL Offset: 0xD14) Configuration and Control Register */
  __I  uint8_t  Reserved11[6];
  RwReg   SHPR2;          /**< (ARM_SYSCTRL Offset: 0xD1C) System Handler Priority Register 2 */
  RwReg   SHPR3;          /**< (ARM_SYSCTRL Offset: 0xD20) System Handler Priority Register 3 */
  RwReg16 SHCSR;          /**< (ARM_SYSCTRL Offset: 0xD24) System Handler Control and State Register */
  __I  uint8_t  Reserved12[10];
  RwReg8  DFSR;           /**< (ARM_SYSCTRL Offset: 0xD30) Debug Fault Status Register */
  __I  uint8_t  Reserved13[191];
  RwReg   DHCSR;          /**< (ARM_SYSCTRL Offset: 0xDF0) Debug Halting Control and Status Register */
  RwReg   DCRSR;          /**< (ARM_SYSCTRL Offset: 0xDF4) Debug Core Register Selector Register */
  RwReg   DCRDR;          /**< (ARM_SYSCTRL Offset: 0xDF8) Debug Core Register Data Register */
  RwReg   DEMCR;          /**< (ARM_SYSCTRL Offset: 0xDFC) Debug Exception and Monitor Control Register */
  __I  uint32_t Reserved14[116];
  RoReg8  SCS_PID4;       /**< (ARM_SYSCTRL Offset: 0xFD0) Peripheral ID Register 4 */
  __I  uint8_t  Reserved15[15];
  RoReg8  SCS_PID0;       /**< (ARM_SYSCTRL Offset: 0xFE0) Peripheral ID Register 0 */
  __I  uint8_t  Reserved16[3];
  RoReg8  SCS_PID1;       /**< (ARM_SYSCTRL Offset: 0xFE4) Peripheral ID Register 1 */
  __I  uint8_t  Reserved17[3];
  RoReg8  SCS_PID2;       /**< (ARM_SYSCTRL Offset: 0xFE8) Peripheral ID Register 2 */
  __I  uint8_t  Reserved18[3];
  RoReg8  SCS_PID3;       /**< (ARM_SYSCTRL Offset: 0xFEC) Peripheral ID Register 3 */
  __I  uint8_t  Reserved19[3];
  RoReg8  SCS_CID0;       /**< (ARM_SYSCTRL Offset: 0xFF0) Component ID Register 0 */
  __I  uint8_t  Reserved20[3];
  RoReg8  SCS_CID1;       /**< (ARM_SYSCTRL Offset: 0xFF4) Component ID Register 1 */
  __I  uint8_t  Reserved21[3];
  RoReg8  SCS_CID2;       /**< (ARM_SYSCTRL Offset: 0xFF8) Component ID Register 2 */
  __I  uint8_t  Reserved22[3];
  RoReg8  SCS_CID3;       /**< (ARM_SYSCTRL Offset: 0xFFC) Component ID Register 3 */
} ArmSysctrl;

