remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/arm_sysctrl.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief ARM_SYSCTRL hardware registers */
typedef struct {  /* ARM System Control */
       RoReg8                         Reserved1[0x8];
  __I  ARM_SYSCTRL_ACTLR_Type         ACTLR;          /**< Offset: 0x08 (R/   32) Auxiliary Control Register (not implemented) */
       RoReg8                         Reserved2[0x4];
  __IO ARM_SYSCTRL_SYST_CSR_Type      SYST_CSR;       /**< Offset: 0x10 (R/W  32) SysTick Control and Status Register */
  __IO ARM_SYSCTRL_SYST_RVR_Type      SYST_RVR;       /**< Offset: 0x14 (R/W  32) SysTick Reload Value Register */
  __IO ARM_SYSCTRL_SYST_CVR_Type      SYST_CVR;       /**< Offset: 0x18 (R/W  32) SysTick Current Value Register (Any Write Clears to 0) */
  __I  ARM_SYSCTRL_SYST_CALIB_Type    SYST_CALIB;     /**< Offset: 0x1C (R/   32) SysTick Calibration Value Register */
       RoReg8                         Reserved3[0xE0];
  __IO ARM_SYSCTRL_NVIC_ISER_Type     NVIC_ISER;      /**< Offset: 0x100 (R/W  32) Interrupt Set-Enable Register */
       RoReg8                         Reserved4[0x7C];
  __IO ARM_SYSCTRL_NVIC_ICER_Type     NVIC_ICER;      /**< Offset: 0x180 (R/W  32) Interrupt Clear Enable Register */
       RoReg8                         Reserved5[0x7C];
  __IO ARM_SYSCTRL_NVIC_ISPR_Type     NVIC_ISPR;      /**< Offset: 0x200 (R/W  32) Interrupt Set-Pending Register */
       RoReg8                         Reserved6[0x7C];
  __IO ARM_SYSCTRL_NVIC_ICPR_Type     NVIC_ICPR;      /**< Offset: 0x280 (R/W  32) Interrupt Clear-Pending Register */
       RoReg8                         Reserved7[0x17C];
  __IO ARM_SYSCTRL_NVIC_IPR0_Type     NVIC_IPR0;      /**< Offset: 0x400 (R/W  32) Interrupt Priority Register 0 */
  __IO ARM_SYSCTRL_NVIC_IPR1_Type     NVIC_IPR1;      /**< Offset: 0x404 (R/W  32) Interrupt Priority Register 1 */
  __IO ARM_SYSCTRL_NVIC_IPR2_Type     NVIC_IPR2;      /**< Offset: 0x408 (R/W  32) Interrupt Priority Register 2 */
  __IO ARM_SYSCTRL_NVIC_IPR3_Type     NVIC_IPR3;      /**< Offset: 0x40C (R/W  32) Interrupt Priority Register 3 */
  __IO ARM_SYSCTRL_NVIC_IPR4_Type     NVIC_IPR4;      /**< Offset: 0x410 (R/W  32) Interrupt Priority Register 4 */
  __IO ARM_SYSCTRL_NVIC_IPR5_Type     NVIC_IPR5;      /**< Offset: 0x414 (R/W  32) Interrupt Priority Register 5 */
  __IO ARM_SYSCTRL_NVIC_IPR6_Type     NVIC_IPR6;      /**< Offset: 0x418 (R/W  32) Interrupt Priority Register 6 */
  __IO ARM_SYSCTRL_NVIC_IPR7_Type     NVIC_IPR7;      /**< Offset: 0x41C (R/W  32) Interrupt Priority Register 7 */
       RoReg8                         Reserved8[0x8E0];
  __I  ARM_SYSCTRL_CPUID_Type         CPUID;          /**< Offset: 0xD00 (R/   32) CPU Identification Register */
  __I  ARM_SYSCTRL_ICSR_Type          ICSR;           /**< Offset: 0xD04 (R/   32) Interrupt Control State Register */
       RoReg8                         Reserved9[0x4];
  __I  ARM_SYSCTRL_AIRCR_Type         AIRCR;          /**< Offset: 0xD0C (R/   32) Application Interrupt and Reset Control Register */
  __IO ARM_SYSCTRL_SCR_Type           SCR;            /**< Offset: 0xD10 (R/W   8) System Control Register */
       RoReg8                         Reserved10[0x3];
  __I  ARM_SYSCTRL_CCR_Type           CCR;            /**< Offset: 0xD14 (R/   16) Configuration and Control Register */
       RoReg8                         Reserved11[0x6];
  __IO ARM_SYSCTRL_SHPR2_Type         SHPR2;          /**< Offset: 0xD1C (R/W  32) System Handler Priority Register 2 */
  __IO ARM_SYSCTRL_SHPR3_Type         SHPR3;          /**< Offset: 0xD20 (R/W  32) System Handler Priority Register 3 */
  __IO ARM_SYSCTRL_SHCSR_Type         SHCSR;          /**< Offset: 0xD24 (R/W  16) System Handler Control and State Register */
       RoReg8                         Reserved12[0xA];
  __IO ARM_SYSCTRL_DFSR_Type          DFSR;           /**< Offset: 0xD30 (R/W   8) Debug Fault Status Register */
       RoReg8                         Reserved13[0xBF];
  __IO ARM_SYSCTRL_DHCSR_Type         DHCSR;          /**< Offset: 0xDF0 (R/W  32) Debug Halting Control and Status Register */
  __IO ARM_SYSCTRL_DCRSR_Type         DCRSR;          /**< Offset: 0xDF4 (R/W  32) Debug Core Register Selector Register */
  __IO ARM_SYSCTRL_DCRDR_Type         DCRDR;          /**< Offset: 0xDF8 (R/W  32) Debug Core Register Data Register */
  __IO ARM_SYSCTRL_DEMCR_Type         DEMCR;          /**< Offset: 0xDFC (R/W  32) Debug Exception and Monitor Control Register */
       RoReg8                         Reserved14[0x1D0];
  __I  ARM_SYSCTRL_SCS_PID4_Type      SCS_PID4;       /**< Offset: 0xFD0 (R/    8) Peripheral ID Register 4 */
       RoReg8                         Reserved15[0xF];
  __I  ARM_SYSCTRL_SCS_PID0_Type      SCS_PID0;       /**< Offset: 0xFE0 (R/    8) Peripheral ID Register 0 */
       RoReg8                         Reserved16[0x3];
  __I  ARM_SYSCTRL_SCS_PID1_Type      SCS_PID1;       /**< Offset: 0xFE4 (R/    8) Peripheral ID Register 1 */
       RoReg8                         Reserved17[0x3];
  __I  ARM_SYSCTRL_SCS_PID2_Type      SCS_PID2;       /**< Offset: 0xFE8 (R/    8) Peripheral ID Register 2 */
       RoReg8                         Reserved18[0x3];
  __I  ARM_SYSCTRL_SCS_PID3_Type      SCS_PID3;       /**< Offset: 0xFEC (R/    8) Peripheral ID Register 3 */
       RoReg8                         Reserved19[0x3];
  __I  ARM_SYSCTRL_SCS_CID0_Type      SCS_CID0;       /**< Offset: 0xFF0 (R/    8) Component ID Register 0 */
       RoReg8                         Reserved20[0x3];
  __I  ARM_SYSCTRL_SCS_CID1_Type      SCS_CID1;       /**< Offset: 0xFF4 (R/    8) Component ID Register 1 */
       RoReg8                         Reserved21[0x3];
  __I  ARM_SYSCTRL_SCS_CID2_Type      SCS_CID2;       /**< Offset: 0xFF8 (R/    8) Component ID Register 2 */
       RoReg8                         Reserved22[0x3];
  __I  ARM_SYSCTRL_SCS_CID3_Type      SCS_CID3;       /**< Offset: 0xFFC (R/    8) Component ID Register 3 */
} ArmSysctrl;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_ARM_SYSCTRL_COMPONENT_ */
